<?php

use App\Guide;
use Illuminate\Database\Seeder;

use App\Region;

class GuidesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $region = new Region;
        $region->name = "ภาคเหนือ";  //เหนือ
        $region->save();

        $region = new Region;
        $region->name = "ภาคอีสาน";  //อีสาน
        $region->save();

        $region = new Region;
        $region->name = "ภาคกลาง";  //กลาง
        $region->save();

        $region = new Region;
        $region->name = "ภาคใต้";  //ใต้
        $region->save();

        $region = new Region;
        $region->name = "คังว็อน";
        $region->country_id = 2;
        $region->save();
        
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "ต้มยำกุ้ง";
        $guide->detail = "ต่างชาติหรือชาวไทยต่างก็ชื่นชอบกับน้ำซุปในรสชาติต้มยำไม่ว่าจะน้ำใสหรือน้ำข้น ก็ให้ความอร่อยไม่รู้ลืม ด้วยวัตถุดิบ ข่า ตะไคร้ พริกขี้หนู ใบมะกรูด เห็ดฟาง กุ้ง และตัวเสริมรสชาติอีกมากมาย ต้มยำกุ้งเป็นอาหารที่มีชื่อเสียงโด่งดังไปถึงต่างประเทศ และดังจนมีชื่อหนังตั้งชื่อเรื่องเป็น ต้มยำกุ้ง ด้วยเช่นกัน โดยการตั้งชื่อหนังว่า ต้มยำกุ้งนั้น น่าจะเป็นการสื่อถึงชื่อที่รู้จักกันดีของชาวต่างชาติและอาจจะเป็นเพราะได้โปรโมทอาหารไทยไปในตัว";
        $guide->picture = "4DQpjUtzLUwmJZZPGTafsujkD7gP7OcE61IB1Hq8knsY.jpg";
        $guide->region_id = 3;
        $guide->save();

        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "ผัดไทย";
        $guide->detail = "ด้วยความที่รสชาติไม่เหมือนใครและไม่มีใครเหมือน ทำให้เส้นจันท์ที่ทั้งนุ่มและเหนียว กลายเป็นที่น่าลิ้มลองของทุกชนชาติ ยิ่งเป็นผัดไทยกุ้งสด ยิ่งเป็นอะไรที่เข้ากันเป็นอย่างมาก ไหนจะมีถั่วปน เต้าหู้ ต้นหอม กุ้งแห้ง ไข่ ไชโป๊ ถั่วงอกดิบ ผักสด เรียกได้ว่าเมนูนี้ยกให้ครองอันดับ 1 เลยก็ว่าได้ ยิ่งร้านไหนทำอร่อยยิ่งทำให้คนกินติดใจทานได้ทุกวันสมและที่ฝรั่งจะชอบทานเมนูนี้กัน";
        $guide->picture = "ppp4.jpg";
        $guide->region_id = 3;
        $guide->save();

        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "วัดพระเเก้ว กรุงเทพฯ";
        $guide->detail = "วัดคู่บ้านคู่เมืองของประเทศไทย และกรุงรัตนโกสินทร์ ก็คือที่นี่ วัดพระศรีรัตนศาสดาราม หรือ วัดพระเเก้ว เป็นวัดในพระบรมมหาราชวังเช่นเดียวกับวัดพระศรีสรรเพชญ์ ซึ่งเป็นวัดในพระราชวังหลวงในสมัยอยุธยา นอกจากนี้ภายในวัดพระศรีรัตนศาสดารามเป็นที่ประดิษฐาน พระพุทธมหามณีรัตนปฏิมากร หรือพระแก้วมรกต ที่นำมาจากกรุงเวียงจันทน์ เป็นวัดหลวงที่สำคัญในพระราชพิธีต่างๆ และยังเป็นแหล่งท่องเที่ยวที่สำคัญของประเทศไทยเราอีกด้วย";
        $guide->picture = "432bf42379e1b8d85a4a85ffdff1481f.jpg";
        $guide->region_id = 3;
        $guide->save();

        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "อ่างขาง เชียงใหม่";
        $guide->detail = "ต้องบอกว่าหนึ่งปีมีแค่ครั้งเดียวเท่านั้นกับการอวดโฉมของซากุระญี่ปุ่น ที่ไม่ต้องบินไปไกลก็สามารถเที่ยวชมกันได้ที่ สถานีเกษตรหลวงอ่างขาง ต้นซากุระญี่ปุ่น และ เชอรี่ (Cherry Blossom) ซึ่งมูลนิธิโครงการหลวงได้นำเข้ามาปลูกทั้งจากญี่ปุ่น และไต้หวันนั้น บานสะพรั่งสีชมพูสวยไปทั้งอ่างขางกว่า 5,000 ต้น นักท่องเที่ยวสามารถเดินชมได้ตามจุดต่างๆ ได้";
        $guide->picture = "ดอยอ่างข่าง-7.jpg";
        $guide->region_id = 1;
        $guide->save();

        $guide = new Guide;
        $guide->type = "culture";
        $guide->title = "ประเพณีตักบาตรดอกไม้";
        $guide->picture = "calendar4.jpg";
        $guide->detail = "ประเพณีตักบาตรดอกไม้ เป็นประเพณีของชาวพุทธโดยมีความเชื่อเรื่องของการทำบุญ พบบางพื้นที่ของประเทศไทย เช่น เป็นประเพณีประจำปีของจังหวัดสระบุรีโดยจัดที่ วัดพระพุทธบาทราชวรมหาวิหาร โดยเมื่อถึงวันเข้าพรรษา หรือวันแรม 1 ค่ำ เดือน 8 ชาว อ.พระพุทธบาท ก็จะพากันไปเก็บดอกเข้าพรรษาที่ขึ้นอยู่ตามไหล่เขาโพธิลังกาหรือเขาสุวรรณบรรพต เทือกเขาวง และเขาพุในเขตมาจัดรวมกับธูปเทียนเพื่อตักบาตรถวายพระ และพระสงฆ์ก็จะนำดอกเข้าพรรษาเหล่านี้ไปสักการะรอยพระพุทธบาท เชื่อกันว่าอานิสงส์นี้จะส่งผลให้ผู้ทำบุญได้ขึ้นสวรรค์ชั้นดาวดึงส์";
        $guide->region_id = 3;
        $guide->save();
    }
}
