<?php

use App\Guide;
use Illuminate\Database\Seeder;

use App\Region;

class GuidesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $region = new Region;
        $region->name = "ภาคเหนือ";  //เหนือ
        $region->save();

        $region = new Region;
        $region->name = "ภาคอีสาน";  //อีสาน
        $region->save();

        $region = new Region;
        $region->name = "ภาคกลาง";  //กลาง
        $region->save();

        $region = new Region;
        $region->name = "ภาคใต้";  //ใต้
        $region->save();

        $region = new Region;
        $region->name = "Gangwon";
        $region->country_id = 2; //korea
        $region->save();

        $region = new Region;
        $region->name = "Jeollanamdo";
        $region->country_id = 2; //korea
        $region->save();

        $region = new Region;
        $region->name = "Hokkaido";
        $region->country_id = 3; //japan
        $region->save();

        $region = new Region;
        $region->name = "Kanto";
        $region->country_id = 3; //japan
        $region->save();

        $region = new Region;
        $region->name = "Central Region";
        $region->country_id = 4; //singapore
        $region->save();

        //Thailand place ใต้
        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "หมู่เกาะสิมิลัน พังงา";
        $guide->picture = "1408617-20180207063409-5b554a4.jpg";
        $guide->detail = "ที่สุดของทะเลไทยต้องยกให้ หมู่เกาะสิมิลัน ซึ่งตั้งอยู่ในอุทยานแห่งชาติหมู่เกาะสิมิลัน จังหวัดพังงา นักท่องเที่ยวทั่วโลกต่างก็ยกให้ที่นี่เป็น “เกาะสวรรค์” เลยทีเดียว เพราะน้ำทะเลที่ใสราวกระจก รวมถึงใต้ทะเลที่เต็มไปด้วยปะการังที่สวยงาม และสัตวน้ำนานาชนิด";
        $guide->region_id = 4;
        $guide->save();

        //Thailand food เหนือ
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "ข้าวซอยไก่";
        $guide->picture = "5rok8sigujykivugyyx0nkk0ydy1mjxlh6ooifb5.png";
        $guide->detail = "อาจกล่าวได้ว่าเป็นอาหารเหนือที่ขึ้นชื่อที่สุด เส้นข้าวซอยราดแกงกะทิ ใส่น่องไก่ โรยด้วยหมี่กรอบ ทานคู่กับหอมแดงซอย พริกป่นผัดน้ำมัน หรือจะบีบมะนาวเพิ่มความสดชื่นด้วยก็ได้ เป็นอาหารที่ใคร ๆ ก็เข้าถึงได้";
        $guide->region_id = 1;
        $guide->save();

        //Thailand food ใต้
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "ผัดสะตอกะปิกุ้ง";
        $guide->picture = "o1AJ9qDyyJNSpZWhUgGYc3MngFqoAN3W5WLWx5JCEJRoLY1En.jpg";
        $guide->detail = "สะตอ ผักพื้นบ้านสัญลักษณ์ของชาวใต้ที่ได้รับความนิยมอย่างแพร่หลาย สะตอเป็นผักที่มีรสชาติและกลิ่นที่เป็นเอกลักษณ์เฉพาะ โดยเมนูที่ได้รับความนิยมในกลุ่มชาวใต้และภาคอื่นๆ คือ ผัดสะตอกับกะปิใส่กุ้ง เมนูนี้หารับประทานได้ง่าย รสชาติมีทั้งเค็ม เปรี้ยว หวานเล็กน้อย และมีความหอมจากกะปิ";
        $guide->region_id = 4;
        $guide->save();
        
        //Thailand food กลาง
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "ต้มยำกุ้ง";
        $guide->detail = "ต่างชาติหรือชาวไทยต่างก็ชื่นชอบกับน้ำซุปในรสชาติต้มยำไม่ว่าจะน้ำใสหรือน้ำข้น ก็ให้ความอร่อยไม่รู้ลืม ด้วยวัตถุดิบ ข่า ตะไคร้ พริกขี้หนู ใบมะกรูด เห็ดฟาง กุ้ง และตัวเสริมรสชาติอีกมากมาย ต้มยำกุ้งเป็นอาหารที่มีชื่อเสียงโด่งดังไปถึงต่างประเทศ";
        $guide->picture = "4DQpjUtzLUwmJZZPGTafsujkD7gP7OcE61IB1Hq8knsY.jpg";
        $guide->region_id = 3;
        $guide->save();

        //Thailand food กลาง
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "ผัดไทย";
        $guide->detail = "ด้วยความที่รสชาติไม่เหมือนใครและไม่มีใครเหมือน ทำให้เส้นจันท์ที่ทั้งนุ่มและเหนียว กลายเป็นที่น่าลิ้มลองของทุกชนชาติ ยิ่งเป็นผัดไทยกุ้งสด ยิ่งเป็นอะไรที่เข้ากันเป็นอย่างมาก ไหนจะมีถั่วปน เต้าหู้ ต้นหอม กุ้งแห้ง ไข่ ไชโป๊ ถั่วงอกดิบ ผักสด เรียกได้ว่าเมนูนี้ยกให้ครองอันดับ 1 เลยก็ว่าได้";
        $guide->picture = "ppp4.jpg";
        $guide->region_id = 3;
        $guide->save();

        //Thailand culture เหนือ
        $guide = new Guide;
        $guide->type = "culture";
        $guide->title = "ขันโตก";
        $guide->picture = "ov.jpg";
        $guide->detail = "สมัยก่อนชาวเหนือมักจะนิยมนั่งกินข้าวบนพื้น ซึ่งเป็นวัฒนธรรมการกินอาหารที่ปฏิบัติสืบต่อกันมา ชาวล้านนาจึงคิดทำขันโตกขึ้นมา โดยนำขันโตก มาทำหน้าที่คล้ายๆโต๊ะอาหาร จัดวางกับข้าวหลายชนิดลงไปให้ดูน่ากิน และพออิ่มหนำจากมื้อเย็นเรียบร้อยแล้ว ก็จะได้ยกขันโตกไปเก็บล้าง ประหยัดเวลา และสะดวกมากขึ้นด้วย";
        $guide->region_id = 1;
        $guide->save();

        //Thailand place อีสาน
        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "ผาชะนะได อุบลราชธานี";
        $guide->detail = "หากใครอยากเห็นแสงแรกของวันก็ต้องมาที่แห่งนี้ เพราะเป็นสถานที่ที่พระอาทิตย์ขึ้นเป็นที่แรกของในทุกๆวันของประเทศไทย ช่วงที่สวยที่สุดและเหมาะกับการไปเที่ยวคือช่วงเดือน ตุลาคม – กุมภาพันธ์ เพราะอากาศกำลังเย็นสบาย มีทะเลหมอกให้ได้ชม";
        $guide->picture = "1.-ผาชะนะได.jpg";
        $guide->region_id = 2;
        $guide->save();

        //Thailand place กลาง
        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "วัดพระเเก้ว กรุงเทพฯ";
        $guide->detail = "วัดคู่บ้านคู่เมืองของประเทศไทย และกรุงรัตนโกสินทร์ ก็คือที่นี่ วัดพระศรีรัตนศาสดาราม หรือ วัดพระเเก้ว ภายในวัดพระศรีรัตนศาสดารามเป็นที่ประดิษฐาน พระพุทธมหามณีรัตนปฏิมากร หรือพระแก้วมรกต ที่นำมาจากกรุงเวียงจันทน์ เป็นวัดหลวงที่สำคัญในพระราชพิธีต่างๆ และยังเป็นแหล่งท่องเที่ยวที่สำคัญของประเทศไทยเราอีกด้วย";
        $guide->picture = "432bf42379e1b8d85a4a85ffdff1481f.jpg";
        $guide->region_id = 3;
        $guide->save();

        //Thailand culture ใต้
        $guide = new Guide;
        $guide->type = "culture";
        $guide->title = "หนังตะลุง";
        $guide->picture = "หนังตะลุง18.jpg";
        $guide->detail = "ศิลปะการแสดงประจำท้องถิ่นของภาคใต้ เป็นการเล่าเรื่องราวที่ผูกร้อยเป็นนิยาย ดำเนินเรื่องด้วยบทร้อยกรองที่ขับร้องเป็นสำเนียงท้องถิ่น เรียกว่าการ \"ว่าบท\" มีบทสนทนาแทรกเป็นระยะ และใช้การแสดงเงาบนจอผ้าเป็นสิ่งดึงดูดสายตาของผู้ชม
        โดยแสดงได้ทั้งในงานบุญและงานศพ หรืองานเฉลิมฉลองที่สำคัญจึงมักมีหนังตะลุงมาแสดงให้ชม";
        $guide->region_id = 4;
        $guide->save();

        //Thailand place ใต้
        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "ตลาดน้ำคลองแห สงขลา";
        $guide->picture = "f4ae4734c50b4082a638393e87509960.jpg";
        $guide->detail = "อีกหนึ่งที่เที่ยวภาคใต้ ที่เป็นน้องใหม่ แต่น่าสนใจสุด ๆ ก็คือ ตลาดน้ำคลองแห ของหาดใหญ่ที่ผสมผสานระหว่าง ตลาดน้ำ และตลาดโบราณบนฝั่งเข้าด้วยกัน ภายในตลาดเต็มไปด้วยเรือพายที่จอดเรียงรายอยู่ริมฝั่งคลองตรงท่าน้ำวัดคลองแห ซึ่งนักท่องเที่ยวจะได้เต็มอิ่มกับอาหารพื้นบ้านที่หลากหลายทั้งไทย มุสลิม และผลผลิตทางการเกษตรของชาวบ้าน";
        $guide->region_id = 4;
        $guide->save();

        //Thailand place กลาง
        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "เกาะเกร็ด นนทบุรี";
        $guide->detail = "สถานที่ท่องเที่ยวที่หลายคนตกหลุมรักตั้งแต่ไปครั้งแรก เพราะได้ทั้งเที่ยว ทำบุญ และกินของอร่อยไปพร้อมๆกัน โดยเฉพาะของกินที่หาทานยากในปัจจุบันก็จะมีมาขายอยู่ริมน้ำที่นี่
        อีกหนึ่งอย่างที่ทำให้มีนักท่องเที่ยวอยากจะมาเที่ยวที่นี่ก็คือ สามารถนั่งเรือไหว้พระรอบเกาะได้";
        $guide->picture = "599cf7900a243828f616f496.jpg";
        $guide->region_id = 3;
        $guide->save();

        //Thailand food อีสาน
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "ส้มตำ";
        $guide->picture = "7E68135B4E03435881B219B331FB9169.jpg";
        $guide->detail = "เป็นหนึ่งในอาหารประจำชาติของคนไทย นิยมมากขนาดติด 1 ใน 10 อาหารไทยยอดนิยมที่ชาวต่างชาติและคนไทยชอบรับประทาน และยังดังไปถึงระดับโลก ส่วนผสมหลักมาจากมะละกอดิบ รสชาติปรับได้ตามใจผู้บริโภค ชอบรสเผ็ดใส่พริกเพิ่ม ชอบรสเปรี้ยวใส่มะนาวเพิ่ม";
        $guide->region_id = 2;
        $guide->save();

        
        //Thailand culture อีสาน
        $guide = new Guide;
        $guide->type = "culture";
        $guide->title = "ประเพณีบุญบั้งไฟ";
        $guide->picture = "925d8650-f3ea-42cd-8cb3-c1406bf81d98.jpg";
        $guide->detail = "ประเพณีสำคัญของภาคอีสานบ้านเราที่ถือปฏิบัติสืบทอดกันมาตั้งแต่สมัยโบราณ ถือเป็นหนึ่งในฮีตสิบสองเดือนของชาวอีสานที่ทำกันในเดือน 6 ช่วงเข้าสู่ฤดูฝนซึ่งเป็นฤดูทำนา จะมีการจุดบั้งไฟเพื่อบูชาเทพยดาและสิ่งศักดิ์สิทธิ์ทั้งหลาย หรือที่ชาวอีสานเรียกกันว่า พญาแถน เป็นการขอให้ฝนตกถูกต้องตามฤดูกาลและทำให้พืชพันธุ์ธัญญาหารอุดมสมบูรณ์";
        $guide->region_id = 2;
        $guide->save();

        //Thailand food เหนือ
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "น้ำพริกหนุ่มกับแคบหมู";
        $guide->picture = "34829336-5174-4c96-aa0f-e13184fdabc9.jpg";
        $guide->detail = "ของฝากชื่อดังจากเมืองเหนือ ของว่างคู่นี้อร่อยจนคุณกินแทนมื้อหลักได้ 3 มื้อ ตัวน้ำพริกทำจากพริกหนุ่ม กระเทียม หอมแดง และผักชี ให้รสเผ็ดเล็กน้อย เข้ากันได้ดีกับความเค็มจากแคบหมู ลองเปลี่ยนจากแคบหมูมาเป็นผักสดหรือผักต้มแทนบ้างก็ได้เพื่อให้ได้สารอาหารครบหมู่";
        $guide->region_id = 1;
        $guide->save();

        //Thailand culture ใต้
        $guide = new Guide;
        $guide->type = "culture";
        $guide->title = "โนรา";
        $guide->picture = "aHR0cHM6Ly9zLmlzYW5vb2suY29tL3RyLzAvdWQvMjgzLzE0MTUxN.jpg";
        $guide->detail = "เป็นนาฏศิลป์ที่ได้รับความนิยมมากที่สุดในบรรดาศิลปะการแสดงของภาคใต้ มีความยั่งยืนมานับเป็นเวลาหลายร้อยปี การแสดงโนราเน้นท่ารำเป็นสำคัญ ต่อมาได้นำเรื่องราวจากวรรณคดีหรือนิทานท้องถิ่นมาใช้ในการแสดงเรื่อง พระสุธนมโนห์รา เป็นเรื่องที่มีอิทธิพลต่อการแสดงมากที่สุดจนเป็นเหตุให้เรียกการแสดงนี้ว่า มโนห์รา";
        $guide->region_id = 4;
        $guide->save();

        //Thailand food อีสาน
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "ก้อย";
        $guide->picture = "49.jpg";
        $guide->detail = "ถ้าเปรียบเมนูนี้กับวัฒนธรรมอาหารฝั่งตะวันตก เราคงเรียกเมนูนี้ว่า ทาร์ทาร์ แบบฉบับอีสาน ก้อยคือเนื้อดิบสับหรือหั่นเป็นชิ้นเล็ก ๆ แล้วนำไปคลุกเคล้ากับเครื่องเทศและผัก เนื้อที่ใช้ทำมีทั้งวัว ควาย กวาง ปลา กุ้ง หรือแม้แต่ไข่มดแดง ส่วนผสมอื่นๆจะเหมือนกับลาบ ทานคู่กับข้าวเหนียวร้อน ๆ เพื่อให้ซึมซับประสบการณ์อาหารอีสานอย่างเต็มที่";
        $guide->region_id = 2;
        $guide->save();

        //Thailand place อีสาน
        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "ภูกระดึง เลย";
        $guide->detail = "หากอยากพิสูจน์รักก็ต้องพาคนรักไปขึ้นภูกระดึง เพราะต้องใช้ระยะเวลาในการเดินขึ้นผ่านจุดน่าสนใจมากมาย เช่น “ผานกแอ่น” จุดท่องเที่ยวชมพระอาทิตย์ขึ้นที่สำคัญ “ผาหล่มสัก” จุดชมพระอาทิตย์ตกที่ต้องมาเมื่อจะไปพิชิตยอดภูกระดึง “ผาหมากดูก” จุดชมดอกกระเจียวในช่วงฤดูฝน น้ำตกถ้ำสอเหนือ สระอโนดาต และอื่นๆ อีกมากมาย ให้เราได้เที่ยวใกล้ชิดกับธรรมชาติแบบจุใจ";
        $guide->picture = "6.-ภูกระดึง.jpg";
        $guide->region_id = 2;
        $guide->save();

        //Thailand food ใต้
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "แกงเหลือง";
        $guide->picture = "kaeng_lueng.jpg";
        $guide->detail = "หรือแกงส้มปักษ์ใต้ มีความแตกต่างจากแกงส้มในภาคอื่นๆ เนื่องจากพริกแกงส้มมีส่วนผสมของ “ขมิ้น” ทำให้สีแกงมีสีเหลือง  มักใช้แกงกับหน่อไม้ดอง, มะละกอ,ไหลบัว, บอน หรือผักอื่นๆตามใจชอบ เพิ่มโปรตีนด้วยกุ้ง หรือปลานิยมเป็น ปลากระพง, ปลานิล, ปลากระบอก, ปลาดุก ฯลฯ รสชาติจะจัดจ้าน ด้วยน้ำแกงเข้มข้นเข้ากันได้อย่างดีกับรสเปรี้ยวของหน่อไม้ดอง";
        $guide->region_id = 4;
        $guide->save();

        //Thailand place เหนือ
        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "วัดร่องขุ่น เชียงราย";
        $guide->picture = "วัดร่องขุ่น.jpg";
        $guide->detail = "วัดที่มีชื่อเสียงโด่งดังอีกแห่งหนึ่งของจังหวัดเชียงราย ออกแบบและก่อสร้างโดย อาจารย์เฉลิมชัย โฆษิตพิพัฒน์ เมื่อ พ.ศ. 2540 พระอุโบสถสีขาวตกแต่งด้วยลวดลายกระจกสีเงินแวววาว หน้าบันประดับด้วยพญานาค ภาพจิตรกรรมฝาผนังภายในพระอุโบสถและห้องแสดงภาพวาดน่าสนใจมาก";
        $guide->region_id = 1;
        $guide->save();

        //Thailand culture กลาง
        $guide = new Guide;
        $guide->type = "culture";
        $guide->title = "ประเพณีรับบัว";
        $guide->detail = "เป็นประเพณีเก่าแก่ที่เกิดและจัดขึ้นในจังหวัดสมุทรปราการ เดิมจัดในวันขึ้น ๑๔ ค่ำ เดือน ๑๑ ของทุกปี โตัชาวอำเภอบางพลี จังหวัดสมุทรปราการมีสิ่งหนึ่งที่ช่วยยืนยันถึงความเป็นผู้มีน้ำใจไมตรีของคนไทยเช่นกัน สิ่งนั้นคือมรดกทางวัฒนธรรมที่บรรพบุรุษของชาวบางพลีได้มอบไว้ให้ลูกหลานของตน นั่นคือ “ประเพณีรับบัว”";
        $guide->picture = "Dw_3oOhUcAAlO5X.jpg";
        $guide->region_id = 3;
        $guide->save();

        //Thailand culture อีสาน
        $guide = new Guide;
        $guide->type = "culture";
        $guide->title = "เซิ้งกระติบ";
        $guide->detail = "เซิ้งกระติบ เป็นการรำของภาคอีสานในงานรื่นเริง ท่าของการรำแสดงให้เห็นถึงความสัมพันธ์ระหว่างศิลปะการดำรงชีวิต เพราะลีลาท่าทางการรำเลียนแบบการทำงาน และท่าทางในชีวิตประจำวันอันเกี่ยวข้องกับการกิน ผู้เซิ้งเป็นผู้หญิง แต่งกายตามแบบพื้นเมืองอีสาน และห้อยกระติบข้าวไว้ข้างตัว ดนตรีที่ใช้ให้จังหวะส่วนใหญ่ คือ กลอง แคน ฉาบ ฆ้อง ฉิ่ง";
        $guide->picture = "maxresdefault.jpg";
        $guide->region_id = 2;
        $guide->save();

        //Thailand culture กลาง
        $guide = new Guide;
        $guide->type = "culture";
        $guide->title = "ประเพณีตักบาตรดอกไม้";
        $guide->picture = "calendar4.jpg";
        $guide->detail = "ประเพณีของชาวพุทธโดยมีความเชื่อเรื่องการทำบุญ พบในจังหวัดสระบุรีโดยจัดที่ วัดพระพุทธบาทราชวรมหาวิหาร โดยเมื่อถึงวันเข้าพรรษา ชาว อ.พระพุทธบาท ก็จะพากันไปเก็บดอกเข้าพรรษามาจัดรวมกับธูปเทียนเพื่อตักบาตรถวายพระ และพระสงฆ์ก็จะนำดอกเข้าพรรษาเหล่านี้ไปสักการะรอยพระพุทธบาท เชื่อกันว่าอานิสงส์นี้จะส่งผลให้ผู้ทำบุญได้ขึ้นสวรรค์ชั้นดาวดึงส์";
        $guide->region_id = 3;
        $guide->save();

        //Thailand culture เหนือ
        $guide = new Guide;
        $guide->type = "culture";
        $guide->title = "ฟ้อนเล็บ";
        $guide->picture = "10288381_855468211137153_1924623487_o.jpg";
        $guide->detail = " เป็นการฟ้อนของชาวไทยภาคเหนือ กระบวนการฟ้อนเช่นเดียวกับชุดฟ้อนเทียน เพียงแต่ไม่ถือเทียน ผู้ฟ้อนสวมเล็บโลหะยาวทุกนิ้ว เว้นแต่นิ้วหัวแม่มือนิยมฟ้อนในเวลากลางวัน ใช้ผู้ฟ้อนจำนวนมาก เป็นศิลปะการแสดงที่เป็นเอกลักษณ์ของภาคเหนือโดยเฉพาะ";
        $guide->region_id = 1;
        $guide->save();

        //Thailand place เหนือ
        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "อ่างขาง เชียงใหม่";
        $guide->detail = "หนึ่งปีมีแค่ครั้งเดียวเท่านั้นกับการอวดโฉมของซากุระญี่ปุ่น ที่ไม่ต้องบินไปไกลก็สามารถเที่ยวชมกันได้ ต้นซากุระญี่ปุ่น และ เชอรี่ ซึ่งมูลนิธิโครงการหลวงได้นำเข้ามาปลูกทั้งจากญี่ปุ่น และไต้หวันนั้น บานสะพรั่งสีชมพูสวยไปทั้งอ่างขางกว่า 5,000 ต้น นักท่องเที่ยวสามารถเดินชมได้ตามจุดต่างๆ ได้";
        $guide->picture = "ดอยอ่างข่าง-7.jpg";
        $guide->region_id = 1;
        $guide->save();

        //----------Korea---------
        //Korea place Gangwon
        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "อุทยานแห่งชาติซอลัคซาน";
        $guide->detail = "หรือสวิสเซอร์แลนด์เกาหลี เป็นอุทยานแห่งชาติขนาดใหญ่ จัดได้ว่าเป็นแนวเขาที่สวยงามมากที่สุดแห่งหนึ่งของเกาหลีซึ่งประกอบด้วย โอซอลัค, เนซอลัค, และนัมซอลัค ตามเทือกเขาแนวนอกและแนวใน และแนวใต้ มีหุบเขาที่มีดอกไม้บานสะพรั่ง ทั้งฤดูใบไม้ผลิและฤดูใบไม้เปลี่ยนสีหุบเขาแห่งนี้จะเปลี่ยนเป็นสีแดงทองทั่วทั้งหุบเขา";
        $guide->picture = "maxresdefaultt.jpg";
        $guide->region_id = 5;
        $guide->save();

        //Korea food Gangwon
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "ทักคาลบี้";
        $guide->detail = "อาหารขึ้นชื่ออีกอย่างนึงของคังวอนคือ ทักคาลบี้ หรือไก่ผัดซอสนั้นเอง และมีถนนทักคาลบี้ ที่มีร้านหลายสิบร้านให้นักท่องเที่ยวเลือกทานได้";
        $guide->picture = "14929719901492972071l.jpg";
        $guide->region_id = 5;
        $guide->save();

        //Korea culture Gangwon
        $guide = new Guide;
        $guide->type = "culture";
        $guide->title = "งานเทศกาลคึงนึงดาโนเจ";
        $guide->detail = "งานเทศกาลถูกจัดขึ้น เพื่อบูชาวิญญาณผู้พิทักษ์ที่ปกป้องเมือง เพื่อความสงบสุขของเมือง ตลอดจนความเจริญงอกงาม ของพืชผลทางการเกษตร ซึ่งงานเทศกาลได้รับการขึ้นทะเบียนเป็น ผลงานชิ้นเอกมรดกทางวาจา และจับต้องไม่ได้ของมนุษยชาติ (The Oral and Intangible Heritage of Humanity) โดยองค์การยูเนสโก";
        $guide->picture = "gangneung-danoje-2.jpg";
        $guide->region_id = 5;
        $guide->save();

        //Korea place Jeollanamdo
        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "หมู่บ้านชอนจู ฮันอก";
        $guide->detail = "ตั้งอยู่ที่เมืองชอนจู มีบ้านเรือนอาคารเก่าแก่ของเกาหลีหรือเรียกที่เรียกกันว่า “ฮันอก” ซึ่งมีอายุมากกว่า 800 ปี ยังคงมีการอนุรักษ์ไว้และได้ทำเป็นจุดท่องเที่ยวขึ้น บ้านเรือนต่างๆในหมู่บ้านชอนจู ฮันอกนั้นจะมีหลังคาที่สวยงามสังเกตุได้จากหลังคาจะโค้งมนรับกับท้องฟ้าในวันอากาศแจ่มใส";
        $guide->picture = "หมู่บ้านโบราณชอนจูฮันอก(JeonjuHanokVillage)โดยKTOURSTORY.jpg";
        $guide->region_id = 6;
        $guide->save();

        //Korea food Jeollanamdo
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "ฮันจองซิก";
        $guide->detail = " เป็นมื้อเต็มโต๊ะที่จัดอาหารมาเป็นชุด เริ่มต้นเสิร์ฟจานเรียกนําย่อยเป็นของเย็น ตามด้วยพวกข้าวต้มหรือโจ๊ก ต่อด้วยอาหารจานหลักซึ่งมีทั้งของต้ม ทอด ย่าง ของหมัก หม้อไฟ ปิดท้ายด้วยเครื่องดื่มของหวานพื้นเมืองอย่าง ชิเค หรือ ซูจองควา (เครื่องดื่มทําจากอบเชย, ลูกพลัม) ซึ่งชุดอาหารที่เสิร์ฟนั้นจะแตกต่างกันไปตามฤดูกาลและภูมิภาค";
        $guide->picture = "2008102300873_0.jpg";
        $guide->region_id = 6;
        $guide->save();

        //Korea culture Jeollanamdo
        $guide = new Guide;
        $guide->type = "culture";
        $guide->title = "เทศกาลภาพยนตร์นานาชาติชนจู";
        $guide->detail = "เทศกาลภาพยนตร์นานาชาติชอนจูเป็นเทศกาลภาพยนต์นานาชาติลำดับที่สามของเกาหลี ต่อจากพูซานและพูซอน โดยจะฉายภาพยนตร์ทางเลือก ภาพยนตร์ดิจิตอล และภาพยนตร์เอเชียนอกกระแส";
        $guide->picture = "may festival wikitree.us.jpg";
        $guide->region_id = 6;
        $guide->save();

        //----------Japan---------
        //Japan place Hokkaido
        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "จุดชมวิวภูเขาฮาโกดาเตะ ";
        $guide->detail = "ได้รับการจัดอันดับ 1 ใน 3 ให้เป็นจุดชมวิวที่สวยที่สุดของประเทศญี่ปุ่น เมื่อขึ้นมาบนภูเขาฮาโกดาเตะที่มีความสูงถึง 334 เมตร ก็จะได้เห็นวิวในมุมกว้าง ๆ ของชุมชนอาโกดาเตะที่ถูกโอบล้อมไปด้วยภูเขาและทะเลอย่างสวยงาม จะมาชมกลางวัน แล้วมาชมกลางคืนซ้ำอีกครั้งก็ไม่แปลก เพราะทั้งสองช่วงเวลานี้ จะให้ความสวยงามที่แตกต่างกันไป";
        $guide->picture = "hakodate_small.jpg";
        $guide->region_id = 7;
        $guide->save();

        //Japan food Hokkaido
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "ปูทาราบะ (King Crab)";
        $guide->detail = "เป็นปูที่มีลักษณะเปลือกเป็นตะปุ่มตะป่ำ บางตัวเมื่อกางขาออกอาจมีขนาดใหญ่กว่า 1 เมตรทีเดียว ด้วยรสชาติอร่อยเข้มข้นทำให้ได้รับสมญานามว่าเป็น “ราชาแห่งปู (King Crab)”
        สำหรับชื่อ “ทาราบะ (Taraba)” นั้นก็มาจากการที่ปูชนิดนี้มักอาศัยอยู่ตามเขตท้องทะเลที่จับปลาค้อด (Cod) หรือที่ชาวญี่ปุ่นเรียกว่าปลาทาระ ได้มากนั่นเอง";
        $guide->picture = "w644 (1).jpg";
        $guide->region_id = 7;
        $guide->save();

        //Japan culture Hokkaido
        $guide = new Guide;
        $guide->type = "culture";
        $guide->title = "เทศกาลหิมะ Sapporo";
        $guide->detail = "เป็นเทศกาลที่ใหญ่ที่สุดในจังหวัด Hokkaido จัดขึ้นช่วงต้นเดือนกุมภาพันธ์ของทุกปี ที่เมือง Sapporo ใน Hokkaido โดยในงาน จะจัดตกแต่งภายในสวน Odori (大通り公園) ด้วยรูปปั้นหิมะ เป็นรูปต่างๆ มีรูปปั้นที่ขนาดสูงถึง 10 เมตรจัดแสดง เป็นเทศกาลที่ตระการตาแห่งหนึ่งที่พลาดไม่ได้เลย";
        $guide->picture = "content_Sapporo_12.jpg";
        $guide->region_id = 7;
        $guide->save();

        //Japan place Kanto
        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "พระราชวังอิมพีเรียล";
        $guide->detail = "เป็นสถานที่สำคัญอีกแห่งของโตเกียว เป็นสถานที่ประทับของสมเด็จพระจักรพรรดิแห่งญี่ปุ่น แต่ก็มีบางส่วนที่เปิดให้นักท่องเที่ยวได้เข้าเที่ยวชม
        ด้านในจะมีปราสาทเอโดะ และมีคูน้ำรายล้อมรอบด้าน พร้อมกับสวนที่เต็มไปด้วยต้นไม้นานาพรรณ ในฤดูใบไม้ผลิจะเต็มไปด้วยดอกซากุระสีชมพูหวานบานสะพรั่ง ส่วนในฤดูใบไม้เปลี่ยนสีก็จะมีใบไม้หลากสีสันให้ได้ชม";
        $guide->picture = "ทัวร์พระราชวังอิมพีเรียลในโตเกียวพร้อมไกด์ที่มีใบรับรอง.jpg";
        $guide->region_id = 8;
        $guide->save();

        //Japan food Kanto
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "โทเงะโนะคะมะเมะชิ";
        $guide->detail = "เมนูข้าวกล่องชนิดหนึ่งสำหรับทานบนรถไฟ หรือที่รู้จักกันในชื่อ “Ekiben” มีวางขายอยู่ตามสถานีรถไฟหรือจุดจำหน่ายสินค้า เมืองอันนะกะ จังหวัดกุมมะ เป็นข้าวอบหม้อดินซึ่งมีลักษณะเด่นตรงบรรจุอยู่ในหม้อดินเผาที่สามารถนำกลับไปใช้ต่อได้ รสชาติละมุน ด้านบนโปะด้วยไข่นกกระทา เกาลัด รากไม้ชนิดหนึ่งเรียกว่าโกะโบ เห็ดหอม หน่อไม้ และเนื้อไก่ เป็นต้น";
        $guide->picture = "kanto-local-food-01-480x320.jpg";
        $guide->region_id = 8;
        $guide->save();

        //Japan culture Kanto
        $guide = new Guide;
        $guide->type = "culture";
        $guide->title = "อาคิตะคันโตมัตสึริ";
        $guide->detail = "จัดขึ้นในเมืองอาคิตะ จุดสำคัญที่สุดของงานนี้คือการแสดงทักษะการเลี้ยงเสาคันโตะ ซึ่งเป็นเสาสูงทำจากไม้ไผ่ และมีแถวโคมไฟกระดาษห้อยอยู่ที่ปลายด้านหนึ่ง เทศกาลคันโตะ มัทสึริ, เนบูตะ มัทสึริ ในอาโอโมริ และทานาบาตะ มัทสึริ แห่งเซนได ถูกเรียกรวมกันว่าเทศกาลที่ยิ่งใหญ่ทั้งสามแห่งภูมิภาคโทโฮคุ";
        $guide->picture = "kan_n01.jpg";
        $guide->region_id = 8;
        $guide->save();

        //----------Singapore---------
        //Singapore place Central
        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "Merlion Park";
        $guide->detail = "สวนสาธารณะขนาดเล็ก ริมอ่าวมารีน่าเบย์ (Marina Bay) เป็นที่ตั้งของรูปปั้นเมอร์ไลอ้อน (Merlion) รูปปั้นที่มีหัวสิงโต และลำตัวของปลา ซึ่งถือเป็นอีกหนึ่งสัญลักษณ์ประจำชาติ ของประเทศสิงคโปร์ และเป็นอีกหนึ่งสถานที่ท่องเที่ยว ยอดนิยมที่มีผู้เข้าชมมากกว่า 1 ล้านคนต่อปี";
        $guide->picture = "Singapore-Merlion1.jpg";
        $guide->region_id = 9;
        $guide->save();

        //Singapore food Central
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "Hainanese Chicken Rice";
        $guide->detail = "หรือข้าวมันไก่สิงคโปร ซึ่งจริงๆแล้วจะเรียกว่าเป็นข้าวมันไก่สไตล์ไฮหนานของประเทศจีน รสชาติแม้จะไม่จัดจ้านเท่าของไทย แต่เน้นที่ความนุ่มลื่น หอมมัน คำโตๆของเนื้อไก่";
        $guide->picture = "Pohs Hainanese chicken rice.jpg";
        $guide->region_id = 9;
        $guide->save();

        //Singapore culture Central
        $guide = new Guide;
        $guide->type = "culture";
        $guide->title = "Deepavali";
        $guide->detail = "เทศกาลดีปาวลี (หรือ \"เทศกาลแห่งแสงไฟ\") ซึ่งเป็นหนึ่งในงานเฉลิมฉลองทางวัฒนธรรมที่สำคัญในสิงคโปร์ เป็นการเฉลิมฉลองชัยชนะแห่งความดีงามที่อยู่เหนือความชั่วร้าย ในช่วงเทศกาลนี้ครอบครัวชาวฮินดูที่อาศัยอยู่ในเมือง จะประดับตกแต่งบ้านด้วยตะเกียงและแสงไฟ มีการมอบของขวัญให้กัน รับประทานอาหารร่วมกันและสวดมนต์บูชาเทพเจ้าผู้ศักดิ์สิทธิ์";
        $guide->picture = "deepavali-5.jpg";
        $guide->region_id = 9;
        $guide->save();

    }
}
