<?php

use App\Guide;
use Illuminate\Database\Seeder;

use App\Region;

class GuidesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $region = new Region;
        $region->name = "ภาคเหนือ";  //เหนือ
        $region->save();

        $region = new Region;
        $region->name = "ภาคอีสาน";  //อีสาน
        $region->save();

        $region = new Region;
        $region->name = "ภาคกลาง";  //กลาง
        $region->save();

        $region = new Region;
        $region->name = "ภาคใต้";  //ใต้
        $region->save();

        $region = new Region;
        $region->name = "คังว็อน";
        $region->country_id = 2;
        $region->save();

        //Thailand food เหนือ
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "ข้าวซอยไก่";
        $guide->picture = "5rok8sigujykivugyyx0nkk0ydy1mjxlh6ooifb5.png";
        $guide->detail = "อาจกล่าวได้ว่าเป็นอาหารเหนือที่ขึ้นชื่อที่สุด เส้นข้าวซอยราดแกงกะทิ ใส่น่องไก่ โรยด้วยหมี่กรอบ ทานคู่กับหอมแดงซอย พริกป่นผัดน้ำมัน หรือจะบีบมะนาวเพิ่มความสดชื่นด้วยก็ได้ เป็นอาหารที่ใคร ๆ ก็เข้าถึงได้ และยังมีแบบอิสลามที่ใช้เนื้อวัวหรือแกะแทนน่องไก่อีกด้วย";
        $guide->region_id = 1;
        $guide->save();
        
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "ต้มยำกุ้ง";
        $guide->detail = "ต่างชาติหรือชาวไทยต่างก็ชื่นชอบกับน้ำซุปในรสชาติต้มยำไม่ว่าจะน้ำใสหรือน้ำข้น ก็ให้ความอร่อยไม่รู้ลืม ด้วยวัตถุดิบ ข่า ตะไคร้ พริกขี้หนู ใบมะกรูด เห็ดฟาง กุ้ง และตัวเสริมรสชาติอีกมากมาย ต้มยำกุ้งเป็นอาหารที่มีชื่อเสียงโด่งดังไปถึงต่างประเทศ และดังจนมีชื่อหนังตั้งชื่อเรื่องเป็น ต้มยำกุ้ง ด้วยเช่นกัน โดยการตั้งชื่อหนังว่า ต้มยำกุ้งนั้น น่าจะเป็นการสื่อถึงชื่อที่รู้จักกันดีของชาวต่างชาติและอาจจะเป็นเพราะได้โปรโมทอาหารไทยไปในตัว";
        $guide->picture = "4DQpjUtzLUwmJZZPGTafsujkD7gP7OcE61IB1Hq8knsY.jpg";
        $guide->region_id = 3;
        $guide->save();

        //Thailand food กลาง
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "ผัดไทย";
        $guide->detail = "ด้วยความที่รสชาติไม่เหมือนใครและไม่มีใครเหมือน ทำให้เส้นจันท์ที่ทั้งนุ่มและเหนียว กลายเป็นที่น่าลิ้มลองของทุกชนชาติ ยิ่งเป็นผัดไทยกุ้งสด ยิ่งเป็นอะไรที่เข้ากันเป็นอย่างมาก ไหนจะมีถั่วปน เต้าหู้ ต้นหอม กุ้งแห้ง ไข่ ไชโป๊ ถั่วงอกดิบ ผักสด เรียกได้ว่าเมนูนี้ยกให้ครองอันดับ 1 เลยก็ว่าได้ ยิ่งร้านไหนทำอร่อยยิ่งทำให้คนกินติดใจทานได้ทุกวันสมและที่ฝรั่งจะชอบทานเมนูนี้กัน";
        $guide->picture = "ppp4.jpg";
        $guide->region_id = 3;
        $guide->save();

        //Thailand culture เหนือ
        $guide = new Guide;
        $guide->type = "culture";
        $guide->title = "ขันโตก";
        $guide->picture = "ov.jpg";
        $guide->detail = "แรกเริ่มเดิมทีสมัยก่อนชาวเหนือมักจะนิยมนั่งกินข้าวบนพื้น ซึ่งเป็นวัฒนธรรมการกินอาหารที่ปฏิบัติสืบต่อกันมาตั้งแต่บรรพบุรุษ ชาวล้านนาจึงคิดทำขันโตกขึ้นมาเพิ่มความสะดวกในการกินมากขึ้น โดยนำขันโตก หรือโตก (ภาษาล้านนาที่แปลว่าภาชนะสำหรับใส่อาหาร) มาทำหน้าที่คล้าย ๆ โต๊ะอาหาร จัดวางกับข้าวหลายชนิดลงไปให้ดูน่ากิน และพออิ่มหนำจากมื้อเย็นเรียบร้อยแล้ว ก็จะได้ยกขันโตกไปเก็บล้าง ประหยัดเวลา และสะดวกมากขึ้นด้วย";
        $guide->region_id = 1;
        $guide->save();

        //Thailand place อีสาน
        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "ผาชะนะได จ.อุบลราชธานี";
        $guide->detail = "หากใครอยากเห็นแสงแรกของวันก็ต้องมาที่แห่งนี้ เพราะเป็นสถานที่ที่พระอาทิตย์ขึ้นเป็นที่แรกของในทุกๆ วันของประเทศไทย ผาชะนะไดเป็นภูเขาสูงที่อยู่เหนือระดับน้ำทะเลประมาณ 450 เมตร ช่วงที่สวยที่สุดและเหมาะกับการไปเที่ยวคือช่วงเดือน ตุลาคม – กุมภาพันธ์ เพราะอากาศกำลังเย็นสบาย มีทะเลหมอกให้ได้ชม ในระหว่างทางขึ้นผาชะนะไดเราจะผ่านลานดอกไม้ดิน พะลานหินวัดภูอานนท์ พะลานถ้ำไฮ พะลานภูโลง พะลานผายะยืด ฯลฯ";
        $guide->picture = "1.-ผาชะนะได.jpg";
        $guide->region_id = 2;
        $guide->save();

        //Thailand place กลาง
        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "วัดพระเเก้ว กรุงเทพฯ";
        $guide->detail = "วัดคู่บ้านคู่เมืองของประเทศไทย และกรุงรัตนโกสินทร์ ก็คือที่นี่ วัดพระศรีรัตนศาสดาราม หรือ วัดพระเเก้ว เป็นวัดในพระบรมมหาราชวังเช่นเดียวกับวัดพระศรีสรรเพชญ์ ซึ่งเป็นวัดในพระราชวังหลวงในสมัยอยุธยา นอกจากนี้ภายในวัดพระศรีรัตนศาสดารามเป็นที่ประดิษฐาน พระพุทธมหามณีรัตนปฏิมากร หรือพระแก้วมรกต ที่นำมาจากกรุงเวียงจันทน์ เป็นวัดหลวงที่สำคัญในพระราชพิธีต่างๆ และยังเป็นแหล่งท่องเที่ยวที่สำคัญของประเทศไทยเราอีกด้วย";
        $guide->picture = "432bf42379e1b8d85a4a85ffdff1481f.jpg";
        $guide->region_id = 3;
        $guide->save();

        //Thailand place กลาง
        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "เกาะเกร็ด นนทบุรี";
        $guide->detail = "สถานที่ท่องเที่ยวที่หลายคนตกหลุมรักตั้งแต่ไปครั้งแรก เพราะได้ทั้งเที่ยว ทำบุญ และกินของอร่อยไปพร้อมๆกัน โดยเฉพาะของกินที่หาทานยากในปัจจุบันก็จะมีมาขายอยู่ริมน้ำที่นี่
        อีกหนึ่งอย่างที่ทำให้มีนักท่องเที่ยวอยากจะมาเที่ยวที่นี่ก็คือ สามารถนั่งเรือไหว้พระรอบเกาะได้";
        $guide->picture = "599cf7900a243828f616f496.jpg";
        $guide->region_id = 3;
        $guide->save();

        //Thailand food อีสาน
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "ส้มตำ";
        $guide->picture = "7E68135B4E03435881B219B331FB9169.jpg";
        $guide->detail = "เป็นหนึ่งในอาหารประจำชาติของคนไทย นิยมมากขนาดติด 1 ใน 10 อาหารไทยยอดนิยมที่ชาวต่างชาติและคนไทยชอบรับประทาน และยังดังไปถึงระดับโลก ส่วนผสมหลักมาจากมะละกอดิบ รสชาติปรับได้ตามใจผู้บริโภค ชอบรสเผ็ดใส่พริกเพิ่ม ชอบรสเปรี้ยวใส่มะนาวเพิ่ม เป็นเมนูสุขภาพและเหมาะสำหรับผู้ต้องการลดน้ำหนักได้อีกด้วย";
        $guide->region_id = 2;
        $guide->save();

        //Thailand food เหนือ
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "น้ำพริกหนุ่มกับแคบหมู";
        $guide->picture = "34829336-5174-4c96-aa0f-e13184fdabc9.jpg";
        $guide->detail = "ของฝากชื่อดังจากเมืองเหนือ ของว่างคู่นี้อร่อยจนคุณกินแทนมื้อหลักได้ 3 มื้อ ตัวน้ำพริกทำจากพริกหนุ่ม กระเทียม หอมแดง และผักชี ให้รสเผ็ดเล็กน้อย เข้ากันได้ดีกับความเค็มจากแคบหมู ลองเปลี่ยนจากแคบหมูมาเป็นผักสดหรือผักต้มแทนบ้างก็ได้เพื่อให้ได้สารอาหารครบหมู่";
        $guide->region_id = 1;
        $guide->save();

        //Thailand food อีสาน
        $guide = new Guide;
        $guide->type = "food";
        $guide->title = "ก้อย";
        $guide->picture = "49.jpg";
        $guide->detail = "ถ้าเปรียบเมนูนี้กับวัฒนธรรมอาหารฝั่งตะวันตก เราคงเรียกเมนูนี้ว่า ทาร์ทาร์ (tartare) ในแบบฉบับอีสาน ก้อยคือเนื้อดิบสับหรือหั่นเป็นชิ้นเล็ก ๆ แล้วนำไปคลุกเคล้ากับเครื่องเทศและผัก เนื้อที่ใช้ทำมีทั้งวัว ควาย กวาง ปลา กุ้ง หรือแม้แต่ไข่มดแดง ส่วนผสมอื่น ๆ จะเหมือนกับลาบ และแน่นอนว่าต้องทานคู่กับข้าวเหนียวร้อน ๆ เพื่อให้ซึมซับประสบการณ์อาหารอีสานอย่างเต็มที่";
        $guide->region_id = 2;
        $guide->save();

        //Thailand place อีสาน
        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "ภูกระดึง เลย";
        $guide->detail = "หากอยากพิสูจน์รักก็ต้องพาคนรักไปขึ้นภูกระดึง เพราะต้องใช้ระยะเวลาในการเดินขึ้นยอดภูผ่านจุดน่าสนใจมากมาย เช่น “ผานกแอ่น” จุดท่องเที่ยวชมพระอาทิตย์ขึ้นที่สำคัญ “ผาหล่มสัก” จุดชมพระอาทิตย์ตกที่ต้องมาให้ได้เมื่อจะไปพิชิตยอดภูกระดึง “ผาหมากดูก” จุดชมดอกกระเจียวในช่วงฤดูฝน นอกจากนั้นยังมีน้ำตกถ้ำสอเหนือ น้ำตกวังกวาง น้ำตกเพ็ญพบใหม่ สระอโนดาต และอื่นๆ อีกมากมาย ให้เราได้เที่ยวใกล้ชิดกับธรรมชาติแบบจุใจ";
        $guide->picture = "6.-ภูกระดึง.jpg";
        $guide->region_id = 2;
        $guide->save();

        //Thailand place เหนือ
        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "วัดร่องขุ่น เชียงราย";
        $guide->picture = "วัดร่องขุ่น.jpg";
        $guide->detail = "วัดที่มีชื่อเสียงโด่งดังอีกแห่งหนึ่งของจังหวัดเชียงราย อยู่ในท้องที่ตำบลป่าอ้อดอนชัย อำเภอเมือง ออกแบบและก่อสร้างโดย อาจารย์เฉลิมชัย โฆษิตพิพัฒน์ เมื่อ พ.ศ. 2540 บนพื้นที่เดิมของวัด 3 ไร่ และขยายออกเป็น 12 ไร่ พระอุโบสถสีขาวตกแต่งด้วยลวดลายกระจกสีเงินแวววาว เป็นเชิงชั้นลดหลั่นกันไป หน้าบันประดับด้วยพญานาค ภาพจิตรกรรมฝาผนังภายในพระอุโบสถและห้องแสดงภาพวาดน่าสนใจมาก";
        $guide->region_id = 1;
        $guide->save();

        //Thailand culture กลาง
        $guide = new Guide;
        $guide->type = "culture";
        $guide->title = "ประเพณีรับบัว";
        $guide->detail = "ประเพณีรับบัว เป็นประเพณีเก่าแก่ที่เกิดและจัดขึ้นในอำเภอบางพลี จังหวัดสมุทรปราการ มาช้านานแต่เพิ่งปรากฏหลักฐานในราว พ.ศ. ๒๔๖๗ ว่าเดิมจัดในวันขึ้น ๑๔ ค่ำ เดือน ๑๑ ของทุกปี และจากคำบอกเล่าของผู้เฒ่าผู้แก่ชาวอำเภอบางพลีดังเป็นที่ทราบกันโดยทั่วไปแล้วนั่นเอง และชาวอำเภอบางพลี จังหวัดสมุทรปราการมีสิ่งหนึ่งที่ช่วยยืนยันถึงความเป็นผู้มีน้ำใจไมตรีของ คนไทยเช่นกัน สิ่งนั้นคือมรดกทางวัฒนธรรมที่บรรพบุรุษของชาวบางพลีได้มอบไว้ให้ลูกหลานของ ตน นั่นคือ “ประเพณีรับบัว”";
        $guide->picture = "Dw_3oOhUcAAlO5X.jpg";
        $guide->region_id = 3;
        $guide->save();

        //Thailand culture อีสาน
        $guide = new Guide;
        $guide->type = "culture";
        $guide->title = "เซิ้งกระติบ";
        $guide->detail = "เซิ้งกระติบ เป็นการรำของภาคอีสานในงานรื่นเริง ท่าของการรำแสดงให้เห็นถึงความสัมพันธ์ระหว่างศิลปะการดำรงชีวิต เพราะลีลาท่าทางการรำเลียนแบบการทำงาน และท่าทางในชีวิตประจำวันอันเกี่ยวข้องกับการกิน ผู้เซิ้งเป็นผู้หญิง แต่งกายตามแบบพื้นเมืองอีสาน คือ นุ่งซิ่นสั้นประมาณเข่า เสื้อแขนกระบอก พาดสไบหรือผ้าเบี่ยง และห้อยกระติบข้าวไว้ข้างตัว ดนตรีที่ใช้ให้จังหวะส่วนใหญ่ คือ กลอง แคน ฉาบ ฆ้อง ฉิ่ง";
        $guide->picture = "maxresdefault.jpg";
        $guide->region_id = 2;
        $guide->save();

        //Thailand culture กลาง
        $guide = new Guide;
        $guide->type = "culture";
        $guide->title = "ประเพณีตักบาตรดอกไม้";
        $guide->picture = "calendar4.jpg";
        $guide->detail = "ประเพณีตักบาตรดอกไม้ เป็นประเพณีของชาวพุทธโดยมีความเชื่อเรื่องของการทำบุญ พบบางพื้นที่ของประเทศไทย เช่น เป็นประเพณีประจำปีของจังหวัดสระบุรีโดยจัดที่ วัดพระพุทธบาทราชวรมหาวิหาร โดยเมื่อถึงวันเข้าพรรษา หรือวันแรม 1 ค่ำ เดือน 8 ชาว อ.พระพุทธบาท ก็จะพากันไปเก็บดอกเข้าพรรษาที่ขึ้นอยู่ตามไหล่เขาโพธิลังกาหรือเขาสุวรรณบรรพต เทือกเขาวง และเขาพุในเขตมาจัดรวมกับธูปเทียนเพื่อตักบาตรถวายพระ และพระสงฆ์ก็จะนำดอกเข้าพรรษาเหล่านี้ไปสักการะรอยพระพุทธบาท เชื่อกันว่าอานิสงส์นี้จะส่งผลให้ผู้ทำบุญได้ขึ้นสวรรค์ชั้นดาวดึงส์";
        $guide->region_id = 3;
        $guide->save();

        //Thailand culture เหนือ
        $guide = new Guide;
        $guide->type = "culture";
        $guide->title = "ฟ้อนเล็บ";
        $guide->picture = "10288381_855468211137153_1924623487_o.jpg";
        $guide->detail = " เป็นการฟ้อนของชาวไทยภาคเหนือ กระบวนการฟ้อนเช่นเดียวกับชุดฟ้อนเทียน เพียงแต่ไม่ถือเทียน ผู้ฟ้อนสวมเล็บโลหะยาวทุกนิ้ว เว้นแต่นิ้วหัวแม่มือนิยมฟ้อนในเวลากลางวัน ใช้ผู้ฟ้อนจำนวนมาก เป็นศิลปะการแสดงที่เป็นเอกลักษณ์ของภาคเหนือโดยเฉพาะ";
        $guide->region_id = 1;
        $guide->save();

        //Thailand place เหนือ
        $guide = new Guide;
        $guide->type = "place";
        $guide->title = "อ่างขาง เชียงใหม่";
        $guide->detail = "ต้องบอกว่าหนึ่งปีมีแค่ครั้งเดียวเท่านั้นกับการอวดโฉมของซากุระญี่ปุ่น ที่ไม่ต้องบินไปไกลก็สามารถเที่ยวชมกันได้ที่ สถานีเกษตรหลวงอ่างขาง ต้นซากุระญี่ปุ่น และ เชอรี่ (Cherry Blossom) ซึ่งมูลนิธิโครงการหลวงได้นำเข้ามาปลูกทั้งจากญี่ปุ่น และไต้หวันนั้น บานสะพรั่งสีชมพูสวยไปทั้งอ่างขางกว่า 5,000 ต้น นักท่องเที่ยวสามารถเดินชมได้ตามจุดต่างๆ ได้";
        $guide->picture = "ดอยอ่างข่าง-7.jpg";
        $guide->region_id = 1;
        $guide->save();
    }
}
