<?php

use Illuminate\Database\Seeder;
use App\Story;

class StoriesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $story = new Story;
        $story->title = "ชิม ช้อป ชม ตลาดน้ำน่าเที่ยวเมืองนนทบุรี สัมผัสวิถีของดีเมืองนนท์";
        $story->detail = "สำนักงานการท่องเที่ยวและกีฬาจังหวัดนนทบุรี จัดกิจกรรมการท่องเที่ยวในตลาดน้ำ 6 แห่ง ภายใต้โครงการ “ตลาดน้ำน่าเที่ยวเมืองนนทบุรี สัมผ้สวิถีของดีเมืองนนท์” หวังสร้างเป็นแหล่งท่องเที่ยวเชิงวัฒนธรรมและวิถีชีวิตไทยใกล้กรุงเทพมหานคร รวมถึงเพิ่มมูลค่าเศรษฐกิจการท่องเที่ยวแก่ชุมชน
        ตลาดน้ำ 6 แห่ง ประกอบด้วย
        ตลาดน้ำไทรน้อย ริมคลองพระพิมล วัดไทรใหญ่ อำเภอไทรน้อย จัดกิจกรรมไปแล้วเมื่อวันที่ 5-6 ตุลาคม 2562
        ตลาดน้ำประชารัฐวัดโตนด ริมคลองอ้อมนนท์ อำเภอเมืองนนทบุรี วันที่ 19-20 ตุลาคม 2562
        ตลาดน้ำวัดใหญ่สว่างอารมณ์ อำเภอปากเกร็ด วันที่ 26-27 ตุลาคม 2562
        ตลาดน้ำวัดตะเคียน อำเภอบางกรวย วันที่ 2-3 พฤศจิกายน 2562
        ตลาดน้ำประชารัฐสวนบัว อำเภอบางใหญ่ วันที่ 9-10 พฤศจิกายน 2562
        ตลาดน้ำวัดบัวขวัญ อำเภอเมืองนนทบุรี วันที่ 16-17 พฤศจิกายน 2562
        ทุกตลาดเปิดเวลา 09.00 – 15.00 น. ยกเว้น ตลาดบัวขวัญ เปิด 10.00 – 21.00 น.";
        $story->picture="w644.jpg";
        $story->save();

        $story = new Story;
        $story->title = "“หัวหิน เชฟเทเบิล” สัมผัสรสชาติจากจินตนาการและความหลงใหล ณ โรงแรมเซ็นทาราแกรนด์บีชรีสอร์ทและวิลลา หัวหิน";
        $story->detail = "อีกครั้งกับการสร้างสีสันแห่งวงการอาหารเพื่อยกระดับ \"หัวหิน เมืองท่องเที่ยว\" อย่างแท้จริง โรงแรมเซ็นทาราแกรนด์บีชรีสอร์ทและวิลลา หัวหิน เชิญคุณต้อนรับลมหนาวด้วยประสบการณ์รับประทานอาหารมื้อพิเศษ \"หัวหิน เชฟเทเบิล\" ประสานจินตนาการของ 3 สุดยอดเชฟมากฝีมือจาก 3 โรงแรมดัง เพื่อถ่ายทอดอรรถรสแห่งฤดูกาลตลอดเดือนตุลาคมและพฤศจิกายนนี้
        ภายใต้บรรยากาศสบายๆเบื้องหน้าท้องฟ้าสีคราม คลอเสียงคลื่นริมหาดหัวหิน โรงแรมเซ็นทาราแกรนด์บีชรีสอร์ทและวิลลา หัวหิน ร่วมกับ โรงแรมอินเตอร์คอนติเนนตัล หัวหิน รีสอร์ท และ โรงแรม หัวหิน แมริออท รีสอร์ท ภายใต้การสนับสนุนของ การท่องเที่ยวแห่งประเทศไทย ขอต้อนรับลมหนาวในเดือนตุลาคมและพฤศจิกายน ด้วยประสบการณ์รับประทานอาหารครั้งพิเศษ \"หัวหิน เชฟเทเบิล\" (Hua Hin Chef's Table 2019) ที่นำเสนอจินตนาการของสุดยอดเชฟมากฝีมือ 3 ท่านจากทั้ง 3 โรงแรมดัง แต่งแต้มด้วยประสบการณ์และความหลงใหลในการปรุงอาหาร เพื่อถ่ายทอดเป็นรสชาติและรสสัมผัสที่ลงตัวและมอบอรรถรสที่ดีที่สุดแห่งฤดูกาลให้ทุกท่านได้ลิ้มลอง";
        $story->picture="iq1b562b334f4dd29034e245a45dceb1b9.jpg";
        $story->save();

        $story = new Story;
        $story->title = "บรรยากาศยามเช้า นักท่องเที่ยวขึ้นอินทนนท์ อากาศเย็น 11องศาฯ ยลทะเลหมอกปลายฝนต้นหนาว";
        $story->detail = "บรรยากาศบนยอดดอยอินทนนท์ อำเภอจอมทอง จังหวัดเชียงใหม่ ซึ่งมีระดับสูงสุดของประเทศไทย และอยู่ในช่วงปลายฝนต้นหนาว โดยเช้าวันนี้อุณหภูมิได้ลดลงเหลือเพียง 11 องศาเซลเซียส และจุดกิ่วแม่ปาน ซึ่งเป็นพื้นที่เดินป่าศึกษาเส้นทางธรรมชาติ อุณหภูมิเช้าวันนี้9องศาเซลเซียส และสภาพท้องฟ้าเปิด ทำให้สามารถเห็นทะเลหมอกที่สวยงามอย่างชัดเจน และเป็นการส่งสัญญานว่าจะย่างเข้าสู่ฤดูหนาวในเร็วๆนี้
        ขณะที่ บรรยากาศการเดินทางขึ้นมายอดดอยอินทนนท์ของนักท่องเที่ยวคึกคักตลอดทั้งปี แต่จะเริ่มหนาแน่นหลังจากวันนี้เป็นต้นไป เนื่องจากเข้าสู่ฤดูกาลการท่องเที่ยว อีกทั้งทางอุทยานแห่งชาติดอยอินทนนท์ เตรียมจะเปิดพื้นที่กิ่วแม่ปานในเดือนพฤศจิกายน 2562 หลังจากที่ปิดฟื้นฟูสภาพป่าไปเมื่อเดือนพฤศจิกายน 2561";
        $story->picture="129327.jpg";
        $story->save();

        $story = new Story;
        $story->title = "สวยงามตระการตา พบถ้ำแห่งใหม่ มีหินงอกหินย้อยส่งประกายแวววาวสวยงาม";
        $story->detail = "นายชัยวัฒน์ เจริญทรัพย์ ผู้ใหญ่บ้านหมู่ที่ 2 บ้านวังพง ตำบลวังหิน อำเภอบ้านไร่ นำทีมสำรวจบนเทือกเขาช่องลม ซึ่งเป็นเทือกเขาหินปูน มีความยาว 3 กิโลเมตร ทอดตัวยาวหลังของวัดเขาช่องลม ต.วังหิน ถ้ำแรกที่พบ ชื่อว่า “ถ้ำช่องลม” อยู่ด้านหลังวัด
        ปากถ้ำพบว่าเป็นถ้ำหินปูนขนาดกว้างใหญ่ ลักษณะเป็นห้องโถง มีพระพุทธรูปของวัดประดิษฐานไว้ให้ประชานได้สักการบูชาเป็นสิริมงคล ถัดไปเล็กน้อยเป็นช่องขนาดกว้าง 1 เมตร สามารถที่จะเดินเข้าไปได้ภายในมีกระแสลมเย็นพัดต่อเนื่อง จึงเรียนว่า “ถ้ำช่องลม” อุณหภูมิภายในเย็นสบาย ประมาณ 25 องศาเชียลเซียส
        ในถ้ำมีหินงอกหินย้อยที่สวยงามรายล้อมด้วยต้นไม้นานาพันธุ์ อากาศเย็นสบาย มีสัตว์ป่าอาศัยอยู่ อาทิ เลียงผา หมีควาย ไก่ป่า นกเงือก ลิงป่าฯลฯ จุดที่สอง เรียกว่า “ถ้ำหอยสังข์” เหมาะสำหรับผู้ที่ชื่นชอบแนวผจญภัยสมบุกสมบัน ชอบความท้าทาย ไม่ควรพลาด ต้องเดินเท้าบุกป่าลัดเลาะปีนป่ายผ่านโขดหินขึ้นไปบนยอดเขา ซึ่งเป็นจุดที่สูงที่สุด
        การเดินทางจุดนี้เป็นไปด้วยความท่าทายบางช่วงมีสภาพที่สูงชันและมีโขดหินตะปุ่มตะป่ำ รายล้อมด้วยต้นไม้น้อยใหญ่ที่ร่มรื่น ใช้เวลาเดินทางจากถ้ำช่องลม 1 ชั่วโมง ส่วนตัวถ้ำจะอยู่ต่ำจากยอดเขาต้องปีนป่ายและลงบันไดไม้ไปด้านล่าง จะมีห้องโถงของถ้ำหลายแห่ง มีหินงอกหินย้อยสวยงามมาก
        บางแห่ง มีร่องรอยกัดกร่อนของน้ำทำให้เกิดชั้นหินเป็นแผ่นบางๆ กลางห้องโถงจะมีหินงอกหินย้อยลักษณะคล้ายกับ “หอยสังข์” จุดนี้ถือเป็นไฮไลท์ที่สวยที่สุด มีจุดถ่ายภาพที่ธรรมชาติสรรค์สร้าง มีช่องหินสามารถเอาใบหน้าเข้าไปได้ มีหินที่ส่องประกายประดุจเพชร แวววับงดงาม สร้างความประทับใจให้กับคณะสำรวจ ขาลงใช้เวลาเดินทางเพียง 30 นาที เท่านั้น
        นายชัยวัฒน์ เจริญทรัพย์ ผู้ใหญ่บ้านบอกว่า ถ้ำหลายแห่งบนเทือกเขาช่องลม มีการพบมานาน แต่ไม่ได้เปิดให้ท่องเที่ยว นับแต่นี้ไป ทางชุมชนร่วมกับทางราชการและทางวัด จะส่งเสริมและพัฒนาให้เป็นแหล่งท่องเที่ยวทางธรรมชาติแห่งใหม่ ของจังหวัดอุทัยธานี
        เรื่องความสวยงามไม่แพ้ถ้ำใดๆ เลย มีศักยภาพด้านการท่องเทียว จึงอยากจะเชิญชวนนักท่องเที่ยวหรือผู้นิยมธรรมชาติ ได้ไปสัมผัสถ้ำแห่ง เมื่อมีการท่องเที่ยวจะส่งผลให้ชาวบ้านมีรายได้จากการนำสินค้าพื้นบ้าน อาหารพื้นเมือง ออกมาจำหน่าย อีกทางหนึ่ง";
        $story->picture="aHR0cHM6Ly9zLmlzYW5vb2suY29tL25zLzAvdWQvMTU2MC83ODAyMjg2LzFjdmVld3EuanBn.jpg";
        $story->save();

        $story = new Story;
        $story->title = "Vogue ยก \"อุทยานแห่งชาติเขาสก\" เป็นสถานที่สวยงามระดับโลก";
        $story->detail = "นิตยสาร Vogue ยก อุทยานแห่งชาติเขาสก เป็นอุทยานฯสวยงามระดับโลก เทียบเยลโล่สโตน - กุ้ยหลิน และ กาลาปากอส
        เพจเฟซบุ๊ก”ส่วนประชาสัมพันธ์และเผยแพร่ กรมอุทยานแห่งชาติ สัตว์ป่า และพันธุ์พืช” เผยแพร่ข้อความที่นิตยสารแฟชั่นชื่อดังระดับโลก อย่าง “โว้ก”(Vogue) ฉบับฝรั่งเศส ได้ยกย่องอุทยานแห่งชาติเขาสก จ.สุราษฎร์ธานีของไทย เป็นอุทยานแห่งชาติที่มีความงดงามระดับโลก
        โดยระบุว่า “เป็นเรื่องที่น่ายินดีที่นิตยสารโว้ก ฝรั่งเศส ได้นำเสนออุทยานแห่งชาติเขาสก จังหวัดสุราษฎร์ธานีของไทย เป็นอุทยานแห่งชาติที่มีความงดงามระดับโลก ร่วมกับอุทยานแห่งชาติที่มีชื่อเสียงรวม 8 แห่ง เช่น อุทยานแห่งชาติเยลโล่สโตน สหรัฐอเมริกา อุทยานแห่งชาติกุ้ยหลินของจีน อุทยานแห่งชาติกาลาปากอสของเอกวาดอร์ เป็นต้น ขอบคุณเจ้าหน้าที่อุทยานแห่งชาติและนักท่องเที่ยวทุกท่านที่ร่วมกันดูแลรักษาอุทยานแห่งชาติแห่งนี้…”";
        $story->picture="0071f38f5a659bacfade2c1e5d7f2082_1555822672.jpg";
        $story->save();
        // factory(Story::class,20)->create();   //เพิ่มใน tinker -> $story = factory(App\Story::class,20)->create()
    }
}
