<?php

use Illuminate\Database\Seeder;
use App\Story;

use App\Country;


class StoriesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //addCountry
        $country = new Country;
        $country->name="Thailand";
        $country->save();

        $country = new Country;
        $country->name="Korea";
        $country->save();

        $country = new Country;
        $country->name="Japan";
        $country->save();

        $country = new Country;
        $country->name="Singapore";
        $country->save();

        //Japan
        $story = new Story;
        $story->title = "ชีวิตดี๊ดี-ซีอีโอหนุ่มใหญ่จับสองเหมียวใส่เป้ พาตะลุยทั่วญี่ปุ่น";
        $story->detail = "ชมภาพของ ฟุคุจัง และ ไดคิจิ เจ้าเหมียวสองตัวจากญี่ปุ่นที่ได้ตระเวนเที่ยวไปทั่ว 1,000 เมือง ใน 47 จังหวัดของประเทศญี่ปุ่นแล้ว โดยมี ไดสุเกะ นางาซาวะ ซีอีโอบริษัทเทคโนโลยี วัย 49 ปี ที่คอยพาเจ้าแมวทั้งสองแบกเป้และใส่รถเข็นเด็กเดินทางไปทั่ว

        จุดเริ่มต้นในการพาแมวเดินทางของเขา มาจากเจ้าไดคิจิ แมวจรจัดขี้โมโห ที่สร้างความลำบากให้แก่ผู้รับเลี้ยงแมว ต้องโทรศัพท์มาหานายไดสุเกะอยู่ร่ำไป ทุกครั้งที่เขาเดินทางไปทำงานต่างถิ่น
        
        สุดท้ายเพื่อตัดปัญหากวนใจ นายไดสุเกะจึงพาเจ้าไดคิจิขี้โมโห วัย 13 ปี และฟุกุจัง วัย 7 ปี แมวส้มน่ารักผู้รับหน้าที่เลขานุการให้แก่บริษัทของเขา ร่วมเดินทางทั่วญี่ปุ่นไปกับเขาด้วย
        
        จนถึงตอนนี้ ซีอีโอผู้นี้และแมวของเขาก็ได้ออกเดินทางร่วมกันมาเป็นเวลา 7 ปีแล้ว เขาได้ถ่ายภาพการเดินทางลงในอินสตราแกรมชื่อ “the.traveling.cats” และในเดือนพฤษภาคม 2017 พวกเขาก็โด่งดังไปทั่วญี่ปุ่น ปัจจุบันเขามีผู้ติดตามอยู่เกือบ 5 พันคน";
        $story->picture="38033480_2147519288797415_6736228515227631616_n_1533029869.jpg";
        $story->user_id = 3;
        $story->country_id=3;
        $story->status = "pass";
        $story->save();

        //Singapore
        $story = new Story;
        $story->title = "Children’s Festival งานคาร์นิวัล ธีม Toy Story 4 ที่ Gardens by the Bay";
        $story->detail = "Gardens by the Bay  สวนพฤกษศาสตร์ขนาดใหญ่ของสิงคโปร์ ในย่าน Marina Bay จัดงานอีเวนท์พิเศษชื่อว่า “Children’s Festival 2019” เพื่อต้อนรับภาพยนตร์อนิเมชั่น Toy Story 4 ที่กำลังฉายอยู่ในโรงภาพยนตร์ทั่วโลก ซึ่งแอดมินเองก็มีโอกาสได้เดินทางไปชมด้วย แต่น่าเสียดายที่เราเก็บภาพบรรยากาศมาให้ชมเพียงแค่โซนเดียว คือ Garden Rhapsody: Disney and Pixar’s Toy Story Adventure และอีเวนท์นี้จะจัดถึงสิ้นเดือนมิถนายน 2562 เท่านั้น
        แปลงโฉมบริเวณรอบ Supertree Grove แห่ง Gardens by the Bay ให้เป็นเหมือนสวนสนุกธีม Toy Story สุดตื่นตา ในรูปแบบงานคาร์นิวัล ที่อัดแน่นไปด้วยกิจกรรมและเกมส์ต่างๆ มากมาย แยกตามธีมของตัวละคร Toy Story
        นอกจากนี้หากมาตรงกับเย็นศุกร์-อาทิตย์ ก็จะมี POP-UP market จำหน่ายสินค้าลิขสิทธิ์แท้ Toy Story และบูธอาหาร ขนม เครื่องดื่ม หลากหลายเมนู ให้เดินชิมกันจนอิ่ม";
        $story->picture="cats-1.jpg";
        $story->user_id = 4;
        $story->country_id=4;
        $story->status = "pass";
        $story->save();

        //Thailand
        $story = new Story;
        $story->title = "Vogue ยก \"อุทยานแห่งชาติเขาสก\" เป็นสถานที่สวยงามระดับโลก";
        $story->detail = "นิตยสาร Vogue ยก อุทยานแห่งชาติเขาสก เป็นอุทยานฯสวยงามระดับโลก เทียบเยลโล่สโตน - กุ้ยหลิน และ กาลาปากอส
        เพจเฟซบุ๊ก”ส่วนประชาสัมพันธ์และเผยแพร่ กรมอุทยานแห่งชาติ สัตว์ป่า และพันธุ์พืช” เผยแพร่ข้อความที่นิตยสารแฟชั่นชื่อดังระดับโลก อย่าง “โว้ก”(Vogue) ฉบับฝรั่งเศส ได้ยกย่องอุทยานแห่งชาติเขาสก จ.สุราษฎร์ธานีของไทย เป็นอุทยานแห่งชาติที่มีความงดงามระดับโลก
        โดยระบุว่า “เป็นเรื่องที่น่ายินดีที่นิตยสารโว้ก ฝรั่งเศส ได้นำเสนออุทยานแห่งชาติเขาสก จังหวัดสุราษฎร์ธานีของไทย เป็นอุทยานแห่งชาติที่มีความงดงามระดับโลก ร่วมกับอุทยานแห่งชาติที่มีชื่อเสียงรวม 8 แห่ง เช่น อุทยานแห่งชาติเยลโล่สโตน สหรัฐอเมริกา อุทยานแห่งชาติกุ้ยหลินของจีน อุทยานแห่งชาติกาลาปากอสของเอกวาดอร์ เป็นต้น ขอบคุณเจ้าหน้าที่อุทยานแห่งชาติและนักท่องเที่ยวทุกท่านที่ร่วมกันดูแลรักษาอุทยานแห่งชาติแห่งนี้…”";
        $story->picture="0071f38f5a659bacfade2c1e5d7f2082_1555822672.jpg";
        $story->user_id = 2;
        $story->status = "notpass";
        $story->save();

        //Korea
        $story = new Story;
        $story->title = "แนะนำเส้นทางรถไฟที่ “แนะนำ” ว่าควรต้องไปสักครั้งที่เกาหลี";
        $story->detail = "“ปาร์ค จุนกยู” ผู้เชี่ยวชาญเส้นทางรถไฟในเกาหลี ใน 1 ปี เขาใช้เวลาร่วม 200 วันอยู่บนรถไฟที่เกาหลี บอกเล่าประสบการณ์ความคลั่งไคล้ในการท่องเที่ยวบนรถไฟ และเส้นทางรถไฟที่เขาชอบมากที่สุดในเกาหลี
        เส้นทางที่คุณจุนกยูแนะนำ เป็นเส้นทางจากโซลไปชมพระอาทิตย์ขึ้นที่ สถานีชองดงจิน (Jeongdongjin) ที่มีความพิเศษคือสามารถชมความสวยงามของทะเลตะวันออกเกาหลี ในระยะใกล้สุด ๆ ได้ เพราะระยะทางจากสถานีรถไฟกับทะเล อยู่ห่างกันเพียงแค่ 50 เมตรเท่านั้น
        เส้นทางชมวิวทะเลที่คุณจุนกยูแนะนำ เป็นเส้นทางจาก สถานีชองนยางนี (Cheongnyangni,청량리) มุ่งหน้าสู่ สถานีชอนดงจิน (Jeongdongjin,정동진)
        ออกจากโซล (สถานีชองนยางนี) เวลา 23.25 น. (5 ทุ่ม 25 นาที) ใช้เวลาวิ่งประมาณ 5 ชั่วโมง 20 นาที ไปถึงวันถัดไปตอนตี 4.28 น. เป็นรถไฟสาย Mugunghwa ค่าโดยสาร 21,000 วอน";
        $story->picture="jeongdongjin-station-sunset.jpg";
        $story->country_id=2;
        $story->user_id = 2;
        $story->status = "pass";
        $story->save();

        //Thailand
        $story = new Story;
        $story->title = "ชิม ช้อป ชม ตลาดน้ำน่าเที่ยวเมืองนนทบุรี สัมผัสวิถีของดีเมืองนนท์";
        $story->detail = "สำนักงานการท่องเที่ยวและกีฬาจังหวัดนนทบุรี จัดกิจกรรมการท่องเที่ยวในตลาดน้ำ 6 แห่ง ภายใต้โครงการ “ตลาดน้ำน่าเที่ยวเมืองนนทบุรี สัมผ้สวิถีของดีเมืองนนท์” หวังสร้างเป็นแหล่งท่องเที่ยวเชิงวัฒนธรรมและวิถีชีวิตไทยใกล้กรุงเทพมหานคร รวมถึงเพิ่มมูลค่าเศรษฐกิจการท่องเที่ยวแก่ชุมชน
        ตลาดน้ำ 6 แห่ง ประกอบด้วย
        ตลาดน้ำไทรน้อย ริมคลองพระพิมล วัดไทรใหญ่ อำเภอไทรน้อย จัดกิจกรรมไปแล้วเมื่อวันที่ 5-6 ตุลาคม 2562
        ตลาดน้ำประชารัฐวัดโตนด ริมคลองอ้อมนนท์ อำเภอเมืองนนทบุรี วันที่ 19-20 ตุลาคม 2562
        ตลาดน้ำวัดใหญ่สว่างอารมณ์ อำเภอปากเกร็ด วันที่ 26-27 ตุลาคม 2562
        ตลาดน้ำวัดตะเคียน อำเภอบางกรวย วันที่ 2-3 พฤศจิกายน 2562
        ตลาดน้ำประชารัฐสวนบัว อำเภอบางใหญ่ วันที่ 9-10 พฤศจิกายน 2562
        ตลาดน้ำวัดบัวขวัญ อำเภอเมืองนนทบุรี วันที่ 16-17 พฤศจิกายน 2562
        ทุกตลาดเปิดเวลา 09.00 – 15.00 น. ยกเว้น ตลาดบัวขวัญ เปิด 10.00 – 21.00 น.";
        $story->picture="w644.jpg";
        $story->user_id = 2;
        $story->status = "pass";
        $story->save();

        //Singapore
        $story = new Story;
        $story->title = "หลุดไปในโลกอนาคต กับ Future World นิทรรศการศิลปะดิจิทัล ที่ ArtScience Museum สิงคโปร์";
        $story->detail = "เที่ยวใกล้เมืองไทย ในสิงคโปร์ หลายคนเคยไปมาทั้ง Merlion, Garden by the bay และ สวนสนุก Universal Studio แต่วันนี้เราอยากให้ทุกคนลองมาชมงานศิลปะล้ำ ๆ ที่ ArtScience Museum ริมอ่าวมาริน่าเบย์ กับนิทรรศการที่มีชื่อว่า “Future World”
        จัดแสดงอยู่ใน ArtScience Museum พิพิธภัณฑ์ดอกบัว ริมอ่าว Marina Bay Sand ประเทศสิงคโปร์ ด้านในแบ่งออกเป็น 4 โซนใหญ่ ๆ คือ Nature, Town, Park และ Space 
        ArtScience Museum เปิดทุกวัน ตั้งแต่ 10.00-19.00 น. แบ่งรอบเข้าชมเป็น 10.00 น., 11.30 น. / 13.00 น. / 14.30 น. / 16.00 น. และ 17.30 น. (รอบสุดท้าย) ";
        $story->picture="future-world-art.jpg";
        $story->country_id=4;
        $story->user_id = 5;
        $story->status = "pass";
        $story->save();

        //Thailand
        $story = new Story;
        $story->title = "“หัวหิน เชฟเทเบิล” สัมผัสรสชาติจากจินตนาการและความหลงใหล ณ โรงแรมเซ็นทาราแกรนด์บีชรีสอร์ทและวิลลา หัวหิน";
        $story->detail = "อีกครั้งกับการสร้างสีสันแห่งวงการอาหารเพื่อยกระดับ \"หัวหิน เมืองท่องเที่ยว\" อย่างแท้จริง โรงแรมเซ็นทาราแกรนด์บีชรีสอร์ทและวิลลา หัวหิน เชิญคุณต้อนรับลมหนาวด้วยประสบการณ์รับประทานอาหารมื้อพิเศษ \"หัวหิน เชฟเทเบิล\" ประสานจินตนาการของ 3 สุดยอดเชฟมากฝีมือจาก 3 โรงแรมดัง เพื่อถ่ายทอดอรรถรสแห่งฤดูกาลตลอดเดือนตุลาคมและพฤศจิกายนนี้
        ภายใต้บรรยากาศสบายๆเบื้องหน้าท้องฟ้าสีคราม คลอเสียงคลื่นริมหาดหัวหิน โรงแรมเซ็นทาราแกรนด์บีชรีสอร์ทและวิลลา หัวหิน ร่วมกับ โรงแรมอินเตอร์คอนติเนนตัล หัวหิน รีสอร์ท และ โรงแรม หัวหิน แมริออท รีสอร์ท ภายใต้การสนับสนุนของ การท่องเที่ยวแห่งประเทศไทย ขอต้อนรับลมหนาวในเดือนตุลาคมและพฤศจิกายน ด้วยประสบการณ์รับประทานอาหารครั้งพิเศษ \"หัวหิน เชฟเทเบิล\" (Hua Hin Chef's Table 2019) ที่นำเสนอจินตนาการของสุดยอดเชฟมากฝีมือ 3 ท่านจากทั้ง 3 โรงแรมดัง แต่งแต้มด้วยประสบการณ์และความหลงใหลในการปรุงอาหาร เพื่อถ่ายทอดเป็นรสชาติและรสสัมผัสที่ลงตัวและมอบอรรถรสที่ดีที่สุดแห่งฤดูกาลให้ทุกท่านได้ลิ้มลอง";
        $story->picture="iq1b562b334f4dd29034e245a45dceb1b9.jpg";
        $story->user_id = 6;
        $story->status = "pass";
        $story->save();

        //Singapore
        $story = new Story;
        $story->title = "การท่องเที่ยวสิงคโปร์ชวนนักช้อป ช้อปกระจายสบายกระเป๋า กับมหกรรมช้อปปิ้งลดกระหน่ำประจำปี";
        $story->detail = "การท่องเที่ยวสิงคโปร์ชวนนักช้อปเปิดประสบการณ์ช้อปสุดฟินกับเทศกาล GSS: Experience Singapore 2019 มหกรรมลดกระหน่ำครั้งยิ่งใหญ่ทั่วทั้งเกาะสิงคโปร์ สูงสุดถึง 70% พร้อมสนุกกับกิจกรรมมากมายตลอด 6 สัปดาห์ ตั้งแต่วันที่ 21 มิถุนายน – 28 กรกฎาคม 2562 กลับมาอีกครั้งกับเทศกาลช้อปปิ้งประจำปีที่ทุกคนรอคอย ที่จะเปลี่ยนสิงคโปร์ทั้งเกาะให้กลายเป็นสวรรค์ของนักช้อป เพราะห้างร้านเล็กใหญ่ทุกหนแห่งจะจัดโปรโมชั่น ลด แลก แจก แถม กันแบบไม่อั้น สูงสุดถึง 70% ไม่ว่าจะเป็นเสื้อผ้า เครื่องประดับ เครื่องใช้ไฟฟ้า ไปจนถึงเฟอร์นิเจอร์ และของแต่งบ้าน นอกจากจะลดกระหน่ำยกเกาะแล้ว ช่วงเทศกาล GSS: Experience Singapore ยังมีกิจกรรมอีกหลายอย่างเพื่อคืนกำไรให้กับนักช้อป";
        $story->picture="iq6f2c19b44f949fcb09584d647a4fc9e3.jpg";
        $story->country_id=4;
        $story->user_id = 7;
        $story->status = "pass";
        $story->save();

        //Japan
        $story = new Story;
        $story->title = "เที่ยวญี่ปุ่นเทศกาลฮาโลวีน ด้วยการแวะช็อปห้างใหม่ Mitsui Shopping Park พร้อมสัมผัสประสบการณ์ตื่นเต้นในงาน Lalaport HALLOWEEN";
        $story->detail = "เปิดให้บริการแล้ว! Mitsui Shopping Park LaLaport NUMAZU ช็อปปิ้งเซ็นเตอร์ในจังหวัดชิสุโอกะ เมืองท่องเที่ยวยอดนิยมของคนไทย ตั้งแต่ 4 ตุลาคม 2562 นี้เป็นต้นไป บริษัท มิตซุย ฟูโดซัง จำกัด ประกาศเปิดตัว Mitsui Shopping Park LaLaport NUMAZU ในเมืองนุมะสุ จังหวัดชิสุโอกะ หนึ่งในจังหวัดท่องเที่ยวสุดฮิต โดยจะจัดงานแกรนด์โอเพนนิ่งในวันศุกร์ที่ 4 ตุลาคม 2562 นี้ ซึ่งถือเป็นการเปิดตัวช็อปปิ้งเซ็นเตอร์ในเครือ 'LaLaport' เป็นสาขาที่ 15 และยังเป็นแห่งแรกในย่านตะวันออกของชิสุโอกะอีกด้วย โดยประกอบไปด้วยร้านค้าชื่อดังยอดนิยมจากทั่วประเทศและร้านค้าประจำท้องถิ่นถึง 214 ร้านค้า Mitsui Shopping Park LaLaport NUMAZU สร้างขึ้นภายใต้คอนเซปต์ \"Live Mall NUMAZU\" เพื่อให้ทุกคนสัมผัสกับความตื่นเต้นและใกล้ชิดผ่านกิจกรรมอย่างเช่นคอนเสิร์ต หรือการแสดงสดต่างๆ";
        $story->picture="iqc6f12ea730e740fb5440c70d759c831c.jpg";
        $story->country_id=3;
        $story->user_id = 2;
        $story->status = "pass";
        $story->save();

        //Korea
        $story = new Story;
        $story->title = "มาแล้ว! พยากรณ์ใบไม้เปลี่ยนสี ที่เกาหลี 2019";
        $story->detail = "ใกล้เข้าสู่ฤดูใบไม้ร่วงของเกาหลีกันอีกแล้ว หนึ่งในช่วงเวลาที่สุดแสนจะโรแมนติก ใบไม้ทยอยเปลี่ยนเป็นสีแดง สีส้ม สีเหลือง ก่อนจะร่วงหล่นจนหมดต้น ซึ่งวันนี้เราก็มี พยากรณ์ใบไม้เปลี่ยนสี ที่เกาหลี ประจำปี 2019 มาฝากกันพร้อมแนะนำสถานที่ชม ไว้เป็นข้อมูลประกอบการตัดสินใจสำหรับใครที่กำลังวางแผนไปเที่ยวเกาหลีในช่วงนี้
        อุทยานแห่งชาติซอรัคซาน 30 กันยายน – 15 ตุลาคม/
        
        กรุงโซล 15 ตุลาคม – 31 ตุลาคม/
        
        จังหวัดคย็องกีโด 15 ตุลาคม – 31 ตุลาคม/
        
        เมืองเคียงจู 15 ตุลาคม – 31 ตุลาคม/
        
        เมืองจอนจู 31 ตุลาคม – 7 พฤศจิกายน/
        
        เกาะเจจู 31 ตุลาคม – 7 พฤศจิกายน/
        
        เมืองปูซาน 31 ตุลาคม – 1พฤศจิกายน";
        $story->picture="korea.jpg";
        $story->country_id=2;
        $story->user_id = 3;
        $story->status = "pass";
        $story->save();

        //Thailand
        $story = new Story;
        $story->title = "บรรยากาศยามเช้า นักท่องเที่ยวขึ้นอินทนนท์ อากาศเย็น 11องศาฯ ยลทะเลหมอกปลายฝนต้นหนาว";
        $story->detail = "บรรยากาศบนยอดดอยอินทนนท์ อำเภอจอมทอง จังหวัดเชียงใหม่ ซึ่งมีระดับสูงสุดของประเทศไทย และอยู่ในช่วงปลายฝนต้นหนาว โดยเช้าวันนี้อุณหภูมิได้ลดลงเหลือเพียง 11 องศาเซลเซียส และจุดกิ่วแม่ปาน ซึ่งเป็นพื้นที่เดินป่าศึกษาเส้นทางธรรมชาติ อุณหภูมิเช้าวันนี้9องศาเซลเซียส และสภาพท้องฟ้าเปิด ทำให้สามารถเห็นทะเลหมอกที่สวยงามอย่างชัดเจน และเป็นการส่งสัญญานว่าจะย่างเข้าสู่ฤดูหนาวในเร็วๆนี้
        ขณะที่ บรรยากาศการเดินทางขึ้นมายอดดอยอินทนนท์ของนักท่องเที่ยวคึกคักตลอดทั้งปี แต่จะเริ่มหนาแน่นหลังจากวันนี้เป็นต้นไป เนื่องจากเข้าสู่ฤดูกาลการท่องเที่ยว อีกทั้งทางอุทยานแห่งชาติดอยอินทนนท์ เตรียมจะเปิดพื้นที่กิ่วแม่ปานในเดือนพฤศจิกายน 2562 หลังจากที่ปิดฟื้นฟูสภาพป่าไปเมื่อเดือนพฤศจิกายน 2561";
        $story->picture="129327.jpg";
        $story->user_id = 8;
        $story->status = "pass";
        $story->save();

         //Korea
         $story = new Story;
         $story->title = "เกาหลีใต้เผยยอดนักท่องเที่ยวต่างชาติเดือนพ.ค.ขยายตัวสดใส จากอานิสงส์นักท่องเที่ยวจีนและญี่ปุ่น";
         $story->detail = "เกาหลี เป็นประเทศที่ติด Top list ที่คนไทยนิยมไปท่องเที่ยว และต้องยอมรับว่า ความสำเร็จที่เกิดขึ้นมาจากการใช้กระแส K-POP เป็นกลยุทธ์สำคัญในการโปรโมท ซึ่งปีนี้คาดว่า จะมีคนไทยไปท่องเที่ยวเกาหลีทะลุ 5.4 แสนคน
         โก บงกิล ผู้อำนวยการองค์การส่งเสริมการท่องเที่ยวเกาหลี ประจำประเทศไทย เปิดเผยว่า นักท่องเที่ยวไทยที่เดินทางไปเกาหลีถือเป็นตลาดใหญ่ที่สุดในภูมิภาคอาเซียน และมีอัตราเพิ่มขึ้นทุกปี โดยตั้งแต่ ม.ค.- ส.ค. 2561 มีนักท่องเที่ยวไทยเดินทางไปเที่ยวเกาหลีแล้ว จำนวน 3.6 แสนคน เพิ่มขึ้น 18.5% เมื่อเทียบกับช่วงเดียวกันของปีที่แล้ว ส่วนทั้งปีคาดว่า จะอยู่ที่ 5.4 แสนคน
         สำหรับกลยุทธ์ดึงนักท่องเที่ยวไทยนั้น ยังเน้นใช้กระแสนิยมวัฒนธรรมเกาหลี  หรือ K-POP ไม่ว่าจะเป็นสถานที่ท่องเที่ยว อาหารเกาหลี เทรนด์แฟชั่นเสื้อผ้าและความงาม มานำเสนอผ่านการใช้นักร้อง นักแสดง และไอดอลเกาหลี เป็นตัวชูโรงในรูปแบบทั้งคอนเสิร์ต ซีรีส์หรือการสร้างคอนเทนท์ผ่านโซเชียลมีเดียต่างๆ
         อย่างในปี 2018 ได้แต่งตั้งวง EXO ศิลปินเกาหลีชื่อดังเป็นทูตการท่องเที่ยวเกาหลี เพื่อดึงดูดและเพิ่มจำนวนนักท่องเที่ยวต่างชาติ ด้วยการจัดทำ 6 วิดีโอโปรโมทเนื้อหาเป็นการแนะนำการท่องเที่ยวของเกาหลีในมุมต่าง ๆ ทั้งประวัติศาสตร์และประเพณี  ชีวิตประจำวันของเกาหลี , การผจญภัย . เทรนด์ . การบำบัด และกระแส K-POP โปรโมทผ่านทางโทรทัศน์ , Youtube , Facebook และสื่อดิจิทัลอื่น ๆ ไปยังทั่วโลก รวมถึงไทยด้วย";
         $story->picture="kpop.png";
         $story->country_id=2;
         $story->user_id = 2;
         $story->status = "pass";
         $story->save();

        //Korea
        $story = new Story;
        $story->title = "เอาใจคนไปเที่ยวโซลให้เที่ยวเองง่ายขึ้น ด้วย AREX Travel Center สาขาใหม่ในฮงแด";
        $story->detail = "การเที่ยวต่างประเทศ โดยเฉพาะในกรุงโซล เมืองหลวงที่แม้จะมีความสบายกระจายตัวทั่วทุกที่อยู่แล้ว แต่ก็ปฏิเสธไม่ได้ว่าพอมี AREX Travel Center สาขาใหม่ในฮงแด ความสะดวกก็เพิ่มมากขึ้น เพราะไม่ใช่แค่ศูนย์การท่องเที่ยวที่มีไว้ให้ข้อมูลกับนักท่องเที่ยวเท่านั้น แต่ยังมีบริการอื่น ๆ อีกมากมายที่ช่วยให้การท่องเที่ยวง่ายขึ้น เช่น บริการจัดเก็บและจัดส่งสัมภาระ บริการจำหน่ายซิมการ์ด เป็นต้น นอกจากนี้เจ้าหน้าที่ยังให้ข้อมูลได้หลายภาษา ทั้งอังกฤษ ญี่ปุ่น และจีน ไม่ว่ามีกรณีฉุกเฉินใด ๆ ก็ขอความช่วยเหลือได้ เพียงแค่ไปที่ชั้น B2 สถานีรถไฟใต้ดิน Hongik Univ. ให้บริการทุกวัน เวลา 8:00-21:00 น.";
        $story->picture="a12ea43836167538f804e6ae878fc582.jpg";
        $story->country_id=4;
        $story->user_id = 6;
        $story->status = "pass";
        $story->save();

        //Japan
        $story = new Story;
        $story->title = "Centurion Hotel Ueno ที่พักใจกลางอุเอโนะ พร้อมอิ่มท้องกับร้านเนื้อย่างสุดพิเศษ";
        $story->detail = "Centurion Hotel Ueno เป็นหนึ่งในโรงแรมหลายๆ แห่งบริเวณ Ueno ที่ได้รับการรีวิวจากนักท่องเที่ยวทั้งไทยและต่างชาติ ว่ามีความสะดวกสบายเป็นอันดับต้นๆ ไม่ว่าจะเป็นทำเลที่ตั้งใกล้ทั้งรถไฟ JR และ Subway ไม่ว่าจะเป็นสถานีรถไฟใต้ดิน Yushima Subway Station และสถานีรถไฟใต้ดิน Uenohirokoji Subway Station โดยใช้เวลาเดิน 3 นาที ห่างจากสถานีรถไฟ JR Okachimachi Train Station โดยใช้เวลาเดิน 5 นาที
        โรงแรมที่นี่รองรับการเข้าพักแบบครอบครัวอย่างแท้จริง เพราะมีห้องพักรองรับการเข้าพักได้เยอะมากถ้าเทียบกับโรงแรมในย่านนี้ เหมาะกับทริป Family ที่ต้องการเข้าพักหลายคนในห้องเดียวกัน และที่พิเศษสุดคือมีร้านเนื้อย่าง Yakiniku Yansando สาขา Uenohirokoji แนะนำ ตั้งอยู่ตรงข้ามกับโรงแรมเลย อิ่มอร่อยกับเนื้อวากิวเกรด A5 ได้ง่ายๆ โดยจองผ่านเคาเตอร์โรงแรมได้ สะดวกสบายสุดๆ";
        $story->picture="Screen-Shot-2562-10-19-at-16.14.04.png";
        $story->country_id=3;
        $story->user_id = 5;
        $story->status = "pass";
        $story->save();
        
        //Thailand
        $story = new Story;
        $story->title = "สวยงามตระการตา พบถ้ำแห่งใหม่ มีหินงอกหินย้อยส่งประกายแวววาวสวยงาม";
        $story->detail = "นายชัยวัฒน์ เจริญทรัพย์ ผู้ใหญ่บ้านหมู่ที่ 2 บ้านวังพง ตำบลวังหิน อำเภอบ้านไร่ นำทีมสำรวจบนเทือกเขาช่องลม ซึ่งเป็นเทือกเขาหินปูน มีความยาว 3 กิโลเมตร ทอดตัวยาวหลังของวัดเขาช่องลม ต.วังหิน ถ้ำแรกที่พบ ชื่อว่า “ถ้ำช่องลม” อยู่ด้านหลังวัด
        ปากถ้ำพบว่าเป็นถ้ำหินปูนขนาดกว้างใหญ่ ลักษณะเป็นห้องโถง มีพระพุทธรูปของวัดประดิษฐานไว้ให้ประชานได้สักการบูชาเป็นสิริมงคล ถัดไปเล็กน้อยเป็นช่องขนาดกว้าง 1 เมตร สามารถที่จะเดินเข้าไปได้ภายในมีกระแสลมเย็นพัดต่อเนื่อง จึงเรียนว่า “ถ้ำช่องลม” อุณหภูมิภายในเย็นสบาย ประมาณ 25 องศาเชียลเซียส
        ในถ้ำมีหินงอกหินย้อยที่สวยงามรายล้อมด้วยต้นไม้นานาพันธุ์ อากาศเย็นสบาย มีสัตว์ป่าอาศัยอยู่ อาทิ เลียงผา หมีควาย ไก่ป่า นกเงือก ลิงป่าฯลฯ จุดที่สอง เรียกว่า “ถ้ำหอยสังข์” เหมาะสำหรับผู้ที่ชื่นชอบแนวผจญภัยสมบุกสมบัน ชอบความท้าทาย ไม่ควรพลาด ต้องเดินเท้าบุกป่าลัดเลาะปีนป่ายผ่านโขดหินขึ้นไปบนยอดเขา ซึ่งเป็นจุดที่สูงที่สุด
        การเดินทางจุดนี้เป็นไปด้วยความท่าทายบางช่วงมีสภาพที่สูงชันและมีโขดหินตะปุ่มตะป่ำ รายล้อมด้วยต้นไม้น้อยใหญ่ที่ร่มรื่น ใช้เวลาเดินทางจากถ้ำช่องลม 1 ชั่วโมง ส่วนตัวถ้ำจะอยู่ต่ำจากยอดเขาต้องปีนป่ายและลงบันไดไม้ไปด้านล่าง จะมีห้องโถงของถ้ำหลายแห่ง มีหินงอกหินย้อยสวยงามมาก
        บางแห่ง มีร่องรอยกัดกร่อนของน้ำทำให้เกิดชั้นหินเป็นแผ่นบางๆ กลางห้องโถงจะมีหินงอกหินย้อยลักษณะคล้ายกับ “หอยสังข์” จุดนี้ถือเป็นไฮไลท์ที่สวยที่สุด มีจุดถ่ายภาพที่ธรรมชาติสรรค์สร้าง มีช่องหินสามารถเอาใบหน้าเข้าไปได้ มีหินที่ส่องประกายประดุจเพชร แวววับงดงาม สร้างความประทับใจให้กับคณะสำรวจ ขาลงใช้เวลาเดินทางเพียง 30 นาที เท่านั้น
        นายชัยวัฒน์ เจริญทรัพย์ ผู้ใหญ่บ้านบอกว่า ถ้ำหลายแห่งบนเทือกเขาช่องลม มีการพบมานาน แต่ไม่ได้เปิดให้ท่องเที่ยว นับแต่นี้ไป ทางชุมชนร่วมกับทางราชการและทางวัด จะส่งเสริมและพัฒนาให้เป็นแหล่งท่องเที่ยวทางธรรมชาติแห่งใหม่ ของจังหวัดอุทัยธานี
        เรื่องความสวยงามไม่แพ้ถ้ำใดๆ เลย มีศักยภาพด้านการท่องเทียว จึงอยากจะเชิญชวนนักท่องเที่ยวหรือผู้นิยมธรรมชาติ ได้ไปสัมผัสถ้ำแห่ง เมื่อมีการท่องเที่ยวจะส่งผลให้ชาวบ้านมีรายได้จากการนำสินค้าพื้นบ้าน อาหารพื้นเมือง ออกมาจำหน่าย อีกทางหนึ่ง";
        $story->picture="aHR0cHM6Ly9zLmlzYW5vb2suY29tL25zLzAvdWQvMTU2MC83ODAyMjg2LzFjdmVld3EuanBn.jpg";
        $story->user_id = 2;
        $story->user_id = 6;
        $story->status = "pass";
        $story->save();

        // factory(Story::class,20)->create();   //เพิ่มใน tinker -> $story = factory(App\Story::class,20)->create()

    }
}
